<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html
  lang="fr-be"
  xml:lang="fr-be"
  xmlns="http://www.w3.org/1999/xhtml">
  <head>
    <meta http-equiv="content-type" content="application/xhtml+xml; charset=utf-8" />
    <title>ExpoActes : Configuration avanc&eacute;e</title>
    <meta name="author" content="Delacharlerie Andre" />
    <link type="text/css" href="./actes_aide.css" rel="stylesheet" />
    <style type="text/css">
.cadre { border: 1px dashed rgb(255, 153, 102);
padding: 15px;
}
<!--
-->
</style>
  </head>
  <body>
    <h1 style="text-align: center;">Expoactes : Param&eacute;trage du logiciel et
      configuration avanc&eacute;e </h1>
    <p style="text-align: center;"><a href="aide.html">Retour &agrave; la liste des
        fichiers d'aide</a> </p>
    <h4>Sommaire</h4>
    <p>Presque tous les &eacute;l&eacute;ments de personnalisation du logiciel (on dit plut&ocirc;t
      param&eacute;trage) sont stock&eacute;s dans la base de donn&eacute;e et peuvent facilement
      &ecirc;tre modifi&eacute;s gr&acirc;ce aux formulaires interactifs accessibles en mode
      administrateur sous l'item "<strong>Param&eacute;trage du logiciel</strong>".</p>
    <p> Pour faciliter la configuration, les param&egrave;tres ont &eacute;t&eacute; regroup&eacute;s en
      plusieurs th&egrave;mes : Affichage, Syst&egrave;me, Utilistateurs ... Une nouvelle
      section "<strong>Etiquettes</strong>" (&agrave; partir de la verson 3.0) permet
      de modifier les intitul&eacute;s des zones affich&eacute;es dans les actes. </p>
    <p>L'ensemble de ces param&egrave;tres peut aussi &ecirc;tre sauvegard&eacute; ou restaur&eacute; selon
      les besoins (notamment en cas de migration de la base d'un h&eacute;bergeur &agrave; un
      autre). Cette proc&eacute;dure est d&eacute;crite dans le <a href="backup.html">chapitre
        backup</a>. </p>
    <p>En plus de cette configuration, quelques autres actions peuvent &ecirc;tre
      apport&eacute;es pour modifier l'apparence du site (essentiellement modifier la
      feuille de styles et ins&eacute;rer des fichiers de textes) ou modifier les
      r&egrave;gles de s&eacute;curisation des donn&eacute;es. </p>
    <p>Ce chapitre traite en d&eacute;tail de ces t&acirc;ches de configuration.</p>
    <ul>
      <li><a href="#secur"><strong>S&eacute;curisation des r&eacute;pertoires</strong></a><br />
      </li>
      <li><a href="#fichinfo"><strong>Fichiers d'informations</strong></a><br />
      </li>
      <li><a href="#styles"><strong>Style des pages</strong></a><br />
      </li>
      <li><a href="#etiquettes"><strong>Etiquettes des donn&eacute;es</strong></a> <br />
      </li>
      <li><a href="#params"><strong>Modifier le comportement du programme avec
            des param&egrave;tres facultatifs</strong></a> <br />
        <ul>
          <li><a href="#EA_DB"><strong>Localisation de la base de donn&eacute;es -
                bases multiples</strong></a><br />
          </li>
          <li> <strong><a href="#Backup">Sauvegarder / restaurer les param&egrave;tres</a></strong>
            <br />
          </li>
          <li><a href="#Affichage"><strong>Affichage des donn&eacute;es (onglet
                Affichage)</strong></a>
            <ul>
              <li><a href="#SITENAME">Identification du site</a></li>
              <li><a href="#Max_page">Quantit&eacute; d'information affich&eacute;e par page</a></li>
              <li><a href="#SHOW_DATE">El&eacute;ments affich&eacute;s dans la page d'accueil</a></li>
              <li><a href="#ANNEE_TABLE">El&eacute;ments affich&eacute;s dans les fiches et
                  listes d'actes</a></li>
              <li><a href="#AVERTISMT">Textes facultatifs</a></li>
              <li>
                <a href="#COOKIES">Messages pour la gestion des cookies</a>
              </li>
            </ul>
          </li>
          <li><a href="#Geoloc"><strong>G&eacute;olocalisation (onglet G&eacute;oloc) </strong></a>
            <ul>
              <li><a href="#GEO_MODE_PUBLIC">Affichage de la carte globale en
                  page d'accueil</a></li>
              <li><a href="#GEO_LOCALITE">Affichage des cartes de localisation
                  individuelles </a><br />
              </li>
            </ul>
          </li>
          <li><a href="#Mail"><strong>Envoi de courrier &eacute;lectronique (onglet
                Mail)</strong></a>
            <ul>
              <li><a href="#EXTERN_MAIL">Choix du mode de gestion des mails</a></li>
              <li><a href="#SMTP_HOST">Param&egrave;tres de serveur de mails externe</a></li>
              <li><a href="#SIGNERR">Mail pour l'envoi des signalements
                  d'erreurs</a></li>
              <li><a href="#CONTACT">Mail pour le formulaire de contact</a></li>
              <li><a href="#TEXTESMAIL">Mails par d&eacute;faut pour la gestion des
                  utilisateurs</a><br />
              </li>
            </ul>
          </li>
          <li><strong><a href="#protection">Gestion des m&eacute;canismes de protection
                (onglet Protection)</a></strong>
            <ul>
              <li><a href="#MLOGIN">Contr&ocirc;le des logins</a> </li>           
              <li><a href="#TIP">Filtrage des adresses IP</a><br />
            </li>
          </ul>
          </li>
          <li><strong><a href="#Recherche">Recherche des donn&eacute;es (onglet
                Recherche)</a></strong>
            <ul>
              <li><a href="#EXTERN_MAIL">Recherches de base et avanc&eacute;es</a></li>
              <li><a href="#RECH_LEVENSHTEIN">Recherches par la m&eacute;thode
                  levenshtein</a></li>
              <li><a href="#geneanet">Liste &eacute;clair "G&eacute;n&eacute;anet"</a><br />
              </li>
            </ul>
          </li>
          <li><strong><a href="#Systeme">Param&egrave;tres globaux et divers (onglet
                Syst&egrave;me)</a></strong>
            <ul>
              <li><a href="#FULL_URL">Gestion des URL du logiciel lui-m&ecirc;me</a></li>
              <li><a href="#URL_JPG">Gestion d'URL vers des images et des pages
                  externes</a></li>
              <li><a href="#META_TAG">Gestion des balises "meta tags"</a></li>
              <li><a href="#GOOGLEANA">Activation des statistiques Google
                  Analytics</a> </li>
              <li><a href="#UPLOAD_DIR">Chargement des fichiers CSV</a></li>
              <li><a href="#SHOW_ACCES">Divers</a><br />
              </li>
            </ul>
          </li>
          <li><strong><a href="#Utilisateurs">Gestion des utilisateurs (onglet
                Utilisateurs)</a></strong>
            <ul>
              <li><a href="#Public_level">Niveau d'acc&egrave;s public aux donn&eacute;es des
                  actes</a></li>
              <li><a href="#USER_AUTO_DEF">Mode de cr&eacute;ation des comptes des
                  utilisateurs enregistr&eacute;s</a></li>
              <li><a href="#LIMITE_EXPIRATION">Dur&eacute;e de validit&eacute; d'un compte -
                  Date d'expiration</a></li>
              <li><a href="#DUREE_EXPIR">Nombre de jours pour statut expir&eacute;</a></li>
              <li><a href="#USER_ZONE_LIBRE">Zone personnalisable dans la liste
                  des utilisateurs</a></li>
              <li><a href="#CHANGE_PW">Droits donn&eacute;s aux utilisateurs</a></li>
              <li><a href="#GEST_POINTS">Gestion de points pour limiter le
                  nombre d'actes pouvant &ecirc;tre affich&eacute;s par utilisateur</a></li>
              <li><a href="#DEPOSANT_LEVEL">Liste des d&eacute;posants</a></li>
              <li><a href="#CONDIT_USAGE">Conditions d'utilisation</a></li>
            </ul>
          </li>
        </ul>
      </li>
    </ul>
    <h1><a id="secur" name="secur"></a>S&eacute;curisation des r&eacute;pertoires</h1>
    <p>Le logiciel installe automatiquement plusieurs fichiers .htaccess
      permettant de contr&ocirc;ler l'acc&egrave;s aux fichers et r&eacute;pertoires :</p>
    <ul>
      <li>Le fichier .htaccess "principal" est plac&eacute; dans le r&eacute;pertoire
        principal du logiciel. Il contient des instructions interdisant
        d'afficher la liste des fichiers de tous les r&eacute;pertoires sous-jacents et
        il reformule les principaux messages d'erreur;</li>
      <li>Le fichier .htaccess plac&eacute; dans le r&eacute;pertoire _config interdit tout
        acc&egrave;s aux fichiers de ce r&eacute;pertoire &agrave; l'exception des feuilles de style
        (fichiers *.css);</li>
      <li>Les fichiers .htaccess plac&eacute;s dans les r&eacute;pertoires "_backup" et
        "_upload" interdisent tout acc&egrave;s externe aux fichiers de ces
        r&eacute;pertoires. </li>
    </ul>
    <p>Le plus souvent, il convient de ne pas modifier ces fichiers ni les
      renommer (le nom commen&ccedil;ant par un point est non seulement normal mais
      obligatoire !). En cas de n&eacute;cessit&eacute;, consulter la documentation Apache
      avant de les modifier.</p>
    <h3><a id="fichinfo" name="fichinfo"></a>Fichiers d'informations</h3>
    Plusieurs (petits) fichiers permettent de personnaliser votre site en
    donnant des informations sp&eacute;cifiques aux visiteurs. Tous ces fichiers sont
    rang&eacute;s dans le r&eacute;pertoire "_config". <br />
    <br />
    Le premier fichier qui peut &ecirc;tre configur&eacute; est le fichier <span style="font-weight: bold;">commentaire.htm</span>.
    Celui-ci contient un (petit) texte qui doit &ecirc;tre r&eacute;dig&eacute; en respectant la
    syntaxe HTML et qui sera affich&eacute; sous la liste des communes dans la page
    d'accueil du module ExpoActes. C'est le lieu privil&eacute;gi&eacute; pour indiquer les
    cr&eacute;dits aux personnes qui ont d&eacute;pouill&eacute; les actes pr&eacute;sent&eacute;s ainsi que
    l'adresse mail où les codes d'acc&egrave;s doivent &ecirc;tre demand&eacute;s lorsque l'acc&egrave;s
    aux d&eacute;tails des actes n'est pas public.<br />
    <br />
    Le second fichier qui peut &ecirc;tre configur&eacute; est le fichier <span style="font-weight: bold;">acces.htm</span>.
    Celui-ci contient un (petit) texte qui doit &ecirc;tre r&eacute;dig&eacute; en respectant la
    syntaxe HTML et qui pr&eacute;sentera le d&eacute;tail des conditions pour avoir acc&egrave;s aux
    d&eacute;tails des actes (s'ils sont masqu&eacute;s) et/ou pour rejoindre le groupe des
    d&eacute;posants. Si ce fichier n'est pas pr&eacute;sent (situation par d&eacute;faut), le
    contenu du fichier commentaire.htm est utilis&eacute; &agrave; sa place.<br />
    <br />
    Le fichier <span style="font-weight: bold;">bandeau.htm</span> peut
    &eacute;galement &ecirc;tre modifi&eacute; pour int&eacute;grer, en t&ecirc;te de chaque page, un bandeau qui
    soit sp&eacute;cifique &agrave; votre site. Vous pouvez alors modifier le code original :<br />
    <br />
    <div style="margin-left: 40px;"> <code>&lt;div class="bandeau"&gt;</code><br />
      <code>&lt;strong&gt;&lt;a href="&lt;?php echo SITE_URL ?&gt;"&gt;&lt;?php
        echo SITENAME ?&gt;&lt;/a&gt; || &lt;/strong&gt;</code><br />
      <code>D&eacute;pouillement de tables et actes d'&eacute;tat-civil ou de registres
        paroissiaux</code><br />
      <code>&lt;/div&gt;<br />
        <br />
      </code> </div>
    en rempla&ccedil;ant ce qui se situe entre <code>&lt;div class="bandeau"&gt;</code>
    et <code>&lt;/div&gt;</code> par une image ou un texte qui vous soit
    sp&eacute;cifique. Attention toutefois &agrave; bien respecter la syntaxe HTML. Pour
    conserver la meilleure lisibilit&eacute; des fiches des actes, il est conseill&eacute; de
    ne pas agrandir trop cette ent&ecirc;te.<br />
    <h3><a id="styles" name="styles"></a>Style des pages </h3>
    La feuille de style <span style="font-weight: bold;">actes.css</span> (dans
    le r&eacute;pertoire <span style="font-weight: bold;">_config</span>) peut &ecirc;tre
    totalement modifi&eacute;e afin de changer assez consid&eacute;rablement les couleurs et
    la pr&eacute;sentation des pages. Comme les programmes font syst&eacute;matiquement
    r&eacute;f&eacute;rence &agrave; la feuille de style pour la mise en page, les mises-&agrave;-jour
    adopteront automatiquement le "look" que vous aurez d&eacute;fini.<br />
    <br />
    Si vous souhaitez modifier le style de certaines pages en particuliers (par
    exemple mettre une image de fond sous les actes), il est possible de d&eacute;finir
    des styles particuliers pour les pages en prenant comme nom celui du
    programme (juste avant le ".php" et en le faisant pr&eacute;c&eacute;der de "#". En
    effet, le tag &lt;body&gt; de chaque page est affect&eacute; de l'identifiant du
    nom de cette page.<br />
    <br />
    Exemple de style &agrave; ajouter dans actes.css pour int&eacute;grer un fond de page dans
    les actes.<br />
    <div style="margin-left: 40px;"><code>#acte_naiss, #acte_mari, #acte_bans,
        #acte_deces<br />
        &nbsp; &nbsp; {<br />
        &nbsp; &nbsp; background : url(../img/fond_act.jpg) repeat;<br />
        &nbsp; &nbsp; }<br />
      </code></div>
    <h3><a id="etiquettes" name="etiquettes"></a>Etiquettes des donn&eacute;es </h3>
    <p>Chacunes des zones de donn&eacute;es des actes peut &agrave; pr&eacute;sent &ecirc;tre renomm&eacute;e
      selon les besoins. Il est aussi possible de choisir les informations qui
      seront affich&eacute;es dans la fiche publique et celles qui ne le seront que
      pour les administrateurs. </p>
    <p>L'&eacute;cran "<strong>Etiquettes</strong>" accessible via le menu "<strong>Administrer
        le logiciel</strong>" affiche la liste de toutes les zones de donn&eacute;es
      utilisables pour chacun des 4 types d'actes. Nous verrons plus loin qu'il
      permet aussi de modifier les intitul&eacute;s des groupes de donn&eacute;es pour les
      actes divers sp&eacute;cifiques. </p>
    <p align="center"><img width="629" height="427" src="Etiquettes.png" /></p>
    <p align="left">Comme on le voit, pour chaque zone on peut d'abord pr&eacute;ciser
      quand elle sera affich&eacute;es :</p>
    <ul>
      <li><strong>Toujours</strong> : La zone est affich&eacute;e tant en mode public
        que dans l'interface d'administration et ce qu'elle contienne une
        information ou non;</li>
      <li><strong>Si non vide</strong> : Elle n'est affich&eacute;e que si la zone
        contient une information et ce en mode public et administration;</li>
      <li><strong>Adminsitration</strong> : La zone est toujours affich&eacute;e en
        mode administration, jamais dans le mode public;</li>
      <li><strong>Inutilis&eacute;</strong> : Cette zone n'est jamais affich&eacute;e. </li>
    </ul>
    <p align="left">On notera que les zones "Pr&eacute;nom" sont toujours associ&eacute;es
      avec la zone "Nom" de la personne. Le r&eacute;glage de l'affichage se fait donc
      via le nom. Ensuite on peut modifier l'intitul&eacute; de la zone. Pour faciliter
      la lecture, les zones sont rassembl&eacute;es en groupes qui portent aussi une
      &eacute;tiquette modifiable. Ces titres de groupe sont affich&eacute;s lorsqu'au moins
      une de ses zones doit &ecirc;tre affich&eacute;e (m&ecirc;me si elle est vide).</p>
    <p align="left">Le cinqui&egrave;me menu permet de modifier les &eacute;tiquettes de
      groupes pour les actes divers selon le type de ces actes. La s&eacute;lection du
      type s'effectue sur base du sigle associ&eacute; &agrave; ce type d'actes.</p>
    <p align="center"><img width="524" height="330" src="etiquettesdiverses.png" /></p>
    <p align="left">Si le sigle d'une s&eacute;rie d'acte n'a pas &eacute;t&eacute; d&eacute;fini, il est
      possible de l'affecter avec le menu de modification group&eacute;e des actes. La
      sauvegarde des &eacute;tiquette s'effectue en m&ecirc;me temps que celle des autres
      param&egrave;tres. </p>
    <p align="left"> &nbsp; </p>
    <h3><a id="params" name="params"></a>Modifier le comportement du programme
      avec des param&egrave;tres facultatifs</h3>
    <p>Les param&egrave;tres r&eacute;gulant le fonctionnement du programme sont g&eacute;r&eacute;s dans
      une table sp&eacute;cifique de la base de donn&eacute;es (act_params) et sont donc
      directement modifiables via des formulaires ad hoc. A chaque param&egrave;tre
      correspond une constante toujours &eacute;crite en caract&egrave;res majuscules qui est
      finalement utilis&eacute;e dans les programmes. Le nom de cette constante est
      toujours indiqu&eacute; entre crochets. </p>
    <h4><a id="EA_DB" name="EA_DB"></a>Localisation de la base de donn&eacute;es -
      bases multiples</h4>
    <p>Il reste toutefois un param&egrave;tre qui doit, s'il est n&eacute;cessaire, &ecirc;tre
      configur&eacute; dans le fichier "<strong>BD-...-connect.inc.php</strong>" (dans le
      r&eacute;pertoire "_config") qui contient aussi les codes d'acc&egrave;s &agrave; la base de
      donn&eacute;es. </p>
    <p>Le param&egrave;tre sp&eacute;cial <strong>EA_DB</strong> est celui qui permet de
      d&eacute;finir un autre pr&eacute;fixe pour les noms des tables de la base de donn&eacute;es.
      Cette option permet de faire cohabiter dans une m&ecirc;me base MySQL, plusieurs
      bases expoactes en pr&eacute;fixant par exemple les table de la seconde base par
      "act2" au lieu du pr&eacute;fixe standard "act".</p>
    <blockquote>
      <p><code>define ("EA_DB","act2"); &nbsp; // pr&eacute;fixe des tables de la seconde
          base Expoactes</code></p>
    </blockquote>
    <p>Pour modifier le fichier BD-...-connect.inc.php, ouvrez-le avec un &eacute;diteur de
      texte tel que le programme "Notepad" de Windows. L'instruction <span style="font-style: italic;">define</span>
      doit &ecirc;tre plac&eacute;e AVANT le code "?&gt;" final.<br />
      <br />
      On comprend &eacute;videmment que ce param&egrave;tre ne peut &ecirc;tre g&eacute;r&eacute; par la base de
      donn&eacute;es puisqu'il indique où trouver cette base de donn&eacute;es.</p>
    <h4><a id="Backup" name="Backup"></a>Sauvegarder / restaurer les param&egrave;tres</h4>
    <p>Le logiciel propose des dispositifs pour r&eacute;aliser des <a href="backup.html">copies
        de s&eacute;curit&eacute; des actes</a> d'une part et de <a href="gestuser.html">la
        liste des utilisateurs</a> d'autre part. La liste des param&egrave;tres
      personnalis&eacute;s de votre installation est le troisi&egrave;me et dernier "paquet"
      d'informations qu'il serait indispensable de retrouver pour restaurer
      votre base apr&egrave;s un crash total. Plus couramment, cette option sera utile
      lorsque pour une raison ou une autre vous d&eacute;cidez de d&eacute;placer votre base
      de donn&eacute;es d'un h&eacute;bergeur chez un autre. </p>
    <p>A cette fin, le menu "<strong>Param&egrave;tres &gt; Backup</strong>" donne
      acc&egrave;s &agrave; un &eacute;cran permettant de sauvegarder l'ensemble des param&egrave;tres dans
      un fichier XML et aussi de relire ce fichier et de modifier les param&egrave;tres
      courants avec ceux pr&eacute;sents dans le fichier XML.</p>
    <ul>
      <li>
        <div align="left"><strong>Pour prendre une souvegarde</strong>, il
          suffit de cliquer sur le lien "Sauvegarder". Le fichier XML dont le
          nom est postfix&eacute; par la date est automatiquement t&eacute;l&eacute;charg&eacute; et il faut
          juste veiller &agrave; le ranger dans un r&eacute;pertoire où vous le retrouverez en
          temps utile. Une bonne solution consiste &agrave; le ranger dans le
          r&eacute;pertoire _backup SUR VOTRE ordinateur.</div>
      </li>
      <li>
        <div align="center"><br />
          <img width="697" height="243" src="restaureparams.png" /> </div>
      </li>
      <li><strong>Pour restaurer les param&egrave;tres</strong>, il suffit de cliquer
        sur le bouton "Parcourir" puis de d&eacute;signer le fichier XML
        "act_params_XXXXXXXX.xml" &agrave; restaurer puis de cliquer sur le bouton "
        &gt;&gt; CHARGER &gt;&gt;". Le reste est automatique. Notons qu'il n'est
        pas possible de restaurer seulement une partie des param&egrave;tres. </li>
    </ul>
    <h4><a id="Affichage" name="Affichage"></a>Affichage des donn&eacute;es (onglet
      Affichage) </h4>
    <blockquote>
      <h5><a id="SITENAME" name="SITENAME"></a>Identification du site </h5>
      <p align="center"><img width="818" height="454" src="parametres.png" /></p>
      <ul>
        <li><strong>Nom du site principal</strong> [SITENAME] : <br />
          Nom de votre site principal. Ce nom est utili&eacute;s dans le cartouche de
          t&ecirc;te, dans l'identification du fil RSS et dans les mails automatiques.
        </li>
        <li><strong>URL du site principal</strong> [SITE_URL] : <br />
          URL relative ou absolue du site web principal (cette URL est
          automatiquement utilis&eacute;e pour cr&eacute;er un lien de retour vers les autres
          pages de votre site web) </li>
      </ul>
      <h5><a id="Max_page" name="Max_page"></a>Quantit&eacute; d'information affich&eacute;e
        par page</h5>
      <ul>
        <li><span style="font-weight: bold;">El&eacute;ments affich&eacute;s par page</span>
          [MAX_PAGE] :<br />
          Concerne l'affichage des r&eacute;sultats d'une recherche et les listes
          d'actes. Lorsque le nombre d'actes trouv&eacute; est sup&eacute;rieur &agrave; cette
          valeur, le surplus est report&eacute; sur une ou plusieurs autres pages
          num&eacute;rot&eacute;es; </li>
        <li><strong>El&eacute;ments par page (mode administration)</strong>
          [MAX_PAGE_ADM] :<br />
          F onction identique au pr&eacute;c&eacute;dent mais concernent les &eacute;crans
          d'administration pour les d&eacute;posants. </li>
        <li><strong>Basculement en mode alphab&eacute;tique</strong> [MAX_PATR] :<br />
          C oncerne l'affichage des patronymes d'une commune. Lorsque le nombre
          de patronymes &agrave; pr&eacute;senter d&eacute;passe ce nombre, alors l'affichage passe
          en mode alphab&eacute;tique en regroupant les patronymes par initiales. Si le
          nombre de patronymes pour une initiale est encore sup&eacute;rieur &agrave;
          MAX_PATR, alors le syst&egrave;me d&eacute;compose sur base de la seconde lettre du
          patronyme et ainsi de suite. </li>
        <li><strong>Mode alphab&eacute;tique (mode administration)</strong>
          [MAX_PATR_ADM] :<br />
          F onction identique au pr&eacute;c&eacute;dent mais concernent les &eacute;crans
          d'administration pour les d&eacute;posants.</li>
      </ul>
      <h5><br />
        <a id="SHOW_DATE" name="SHOW_DATE"></a>El&eacute;ments affich&eacute;s dans la page
        d'accueil</h5>
      <p> La page d'accueil telle qu'elle est con&ccedil;ue dans la version par d&eacute;faut
        apporte beaucoup d'informations sur les actes qui sont pr&eacute;sents dans la
        base de donn&eacute;es. Toutefois, lorsque cette base de donn&eacute;es est
        volumineuse (&agrave; partir de 50.000 ou 100.000 actes) la liste peut &ecirc;tre
        trop longue est volumineuse. Il convient donc, dans ce cas, d'all&eacute;ger
        cette page en utilisant un ou plusieurs des param&egrave;tres suivants : </p>
      <ul>
        <li><strong>Accueil : affichage des dates min. et max.</strong>
          [SHOW_DATES] :<br />
          D&eacute;termine si les dates minimales et maximales des actes d'une commune
          sont affich&eacute;s dans la page d'accueil d'expoactes. Par d&eacute;faut,
          SHOW_DATES vaut 1 (=case coch&eacute;e).</li>
        <li><strong> <strong>Accueil : lien vers la distribution des ann&eacute;es</strong></strong>
          [SHOW_DISTRIBUTION] : <br />
          D&eacute;termine si l'ic&ocirc;ne faisant le lien vers les statistiques des actes
          par ann&eacute;es est pr&eacute;sent dans le tableau public. NB : L'affichage de
          lien n&eacute;cessite aussi que le param&egrave;tre SHOW_DATES soit activ&eacute;.<strong>
          </strong>Par d&eacute;faut, SHOW_DISTRIBUTION vaut 0 (=case non coch&eacute;e).</li>
        <li><strong>Accueil : afficher tous les types d'actes</strong>
          [SHOW_ALLTYPES] :<br />
          D&eacute;termine si la page d'accueil affiche le tableau r&eacute;sum&eacute; des quatre
          types d'actes (par d&eacute;faut) ou d'un seul. Par d&eacute;faut, SHOW_ALLTYPES
          vaut 1 (activ&eacute;).<br />
          Lorsque la page d'accueil n'affiche qu'un type &agrave; la fois, le passage
          d'un type &agrave; l'autre s'effectue en s&eacute;lectionnant le type dans le r&eacute;sum&eacute;
          statistique qui comporte alors les liens ad hoc. &nbsp; </li>
      </ul>
      <h5><a id="ANNEE_TABLE" name="ANNEE_TABLE"></a>El&eacute;ments affich&eacute;s dans les
        fiches et listes d'actes</h5>
      <p>Quelques param&egrave;tres permettent aussi de contr&ocirc;ler l'affichage des
        listes d'actes et des fiches d&eacute;taill&eacute;es.</p>
      <ul>
        <li><strong>Tables : affichages des ann&eacute;es seulement</strong>
          [ANNEE_TABLE] : <br />
          L'affichage des tables d'actes pr&eacute;sente en principe la date compl&egrave;te
          des actes. Il est possible de limiter cet affichage &agrave; l'ann&eacute;e
          seulement, soit pour les visteurs nonconnect&eacute;s (valeur 1) soit aussi
          pour les visteurs connect&eacute;s qui n'ont pas le statut de d&eacute;posant
          (valeur 2). Cette option permet d'obliger les visiteurs enregistr&eacute;s &agrave;
          consulter l'acte (avec d&eacute;compte d'un point) pour conna&icirc;tre la date
          exacte de l'&eacute;venement.<br />
          enfin, la valeur 3 impose syst&eacute;matiquement la limitation de
          l'affichage des date aux ann&eacute;es seulement. Cette option interdit donc
          la recopie de tables.</li>
        <li><strong>Actes : images seulement si login</strong><strong> </strong>[JPG_SI_LOGIN]
          :<br />
          Lorsque cette case est coch&eacute;e, les lien vers les <a href="#URL_JPG">images
            d'actes</a> ou les liens http (zone "Cote", "Libre", "Commentaires
          g&eacute;n&eacute;raux" et "Photos") n'apparaissent que lorsque le visiteur est
          connect&eacute;; dans le cas contraire le texte "image priv&eacute;e"ou "document
          priv&eacute;" est affich&eacute;. </li>
      </ul>
      <h5><a id="AVERTISMT" name="AVERTISMT"></a>Textes facultatifs</h5>
      <p>Quelques param&egrave;tres permettent d'ajouter de petit morceaux de texte
        dans certains &eacute;crans du logiciel.</p>
      <ul>
        <li><strong>Texte d'avertissement</strong> [AVERTISMT] : <br />
          Texte facultatif &agrave; afficher en t&ecirc;te de la premi&egrave;re page au dessus de
          l'inventaire des communes. </li>
        <li><strong>Pied de page</strong> [PIED_PAGE] : <br />
          Texte libre qui est affich&eacute; sur au millieu du pied de page de toutes
          les pages du logiciel. Cette zone peut contenir un texte ordinaire, un
          texte format&eacute; en HTML (contenant par exemple un lien vers une autre
          page) ou m&ecirc;me un script javascript (pour un compteur de visiteurs par
          exemple).</li>
        <li> <strong>Zone de pub sous le menu </strong> [PUB_ZONE_MENU] : <br />
          Il est possible de faire afficher sous le menu un texte quelconque
          tels qu'une publicit&eacute; pour vos activit&eacute;s. Il peut aussi &ecirc;tre utilis&eacute;
          pour afficher un cadre de publicit&eacute;s type "Google Adsens". Cette zone
          doit &ecirc;tre compl&eacute;t&eacute;e par du HTML valide. Le style .pub_menu peut &ecirc;tre
          utilement cr&eacute;&eacute; dans la CSS.</li>
      </ul>
    </blockquote>
    <blockquote>
      <h5><a id="COOKIES" name="AVERTISMT"></a>Messages pour la gestion des
        cookies</h5>
      <p>Depuis 2014, tous les sites web europ&eacute;ens qui utilisent des cookies
        sont sens&eacute;s en informer les visiteurs. Chaque pays de l'Union Europ&eacute;enne
        a traduit cette directive dans sa loi nationale et les dispositions
        varient l&eacute;g&egrave;rement d'un pays &agrave; l'autre. Afin de faciliter la mise en
        conformit&eacute; des sites utilisant ExpoActes, une dispositif a &eacute;t&eacute; ajout&eacute;
        dans la version 3.2 afin d'afficher un message d'avertissement lors de
        la premi&egrave;re visite du site puis tous les ans ensuite.</p>
      <p>Sans entrer dans les d&eacute;tails de la r&eacute;glementation, il faut savoir que
        les cookies strictement n&eacute;cessaires au fonctionnement du site (par
        exemple ceux m&eacute;morisant le login d'un jour &agrave; l'autre) ne doivent pas
        faire l'objet d'une d&eacute;claration. Par contre, si vous utilisez Google
        Analystics, ou un syst&egrave;me du m&ecirc;me type, ou que vous affichez des
        publicit&eacute;s via une r&eacute;gie telle que Google AdSense, ces syst&egrave;mes
        utilisent des cookies dont l'annonce au visiteur est absolument obligatoire.
        </p>
      <p>Les param&egrave;tres suivants vous permettent de personnaliser ce dispositif
        :</p>
      <ul>
        <li><b>Message acceptation des cookies </b>[<span class="aide" style=""
            id="aide15">COOKIE_MESSAGE</span>]
          : <br />
          <span class="aide" style="" id="aide15">Ce message, affich&eacute; tous les
            ans, annonce l'utilisation des cookies sur le site. Vous pouvez
            personnaliser le message en fonction des services activ&eacute;s (google
            analytics, publicit&eacute;, r&eacute;seaux sociaux, ...)</span>. </li>
        <li><b>URL d'une page sur les cookie</b> [<span class="aide" style="" id="aide16">COOKIE_URL_INFO</span>]
          : <br />
          La r&eacute;glementation recommande d'informer aussi pr&eacute;cis&eacute;ment que possible
          le visiteur sur les cookies mis en oeuvre. Vous pouvez donc cr&eacute;er une
          page web informative &agrave; cet effet <span class="aide" style="" id="aide16">et
            pr&eacute;ciser ici l'URL de cette page. Il peut s'agir d'une page interne
            au site ou externe.</span></li>
        <li> <strong><b>Style du message cookies</b> </strong>[<span class="aide"
            style=""
            id="aide17">COOKIE_STYLE</span>]
          : <span class="aide" style="" id="aide17"></span><span class="aide" style=""
            id="aide17"><br />
            Le texte du message pr&eacute;cis&eacute; ci-dessus appara&icirc;t dans une bo&icirc;te de
            dialogue dont vous avez la possibilit&eacute; de pr&eacute;ciser le positionnement
            sur la page (en haut, en bas ou "flottante") ainsi que le style qui
            peut &ecirc;tre un texte clair sur un fond fonc&eacute; ou l'inverse.</span></li>
      </ul>
      </blockquote>
    <h4><a id="Geoloc" name="Geoloc"></a>G&eacute;olocalisation (onglet G&eacute;oloc)</h4>
    <blockquote>
      <h5><a id="GEO_MODE_PUBLIC" name="GEO_MODE_PUBLIC"></a>Affichage de la
        carte globale en page d'accueil</h5>
      <p align="left">Selon l'importance de la base et les choix de
        l'administrateur il peut &ecirc;tre int&eacute;ressant de moduler la mani&egrave;re dont
        sera affich&eacute;e (ou non) la carte globale en page d'accueil (au niveau
        visiteurs). </p>
      <p align="left">Le premier param&egrave;tre (GEO_MODE_PUBLIC) pr&eacute;cise le <strong>Contenu
          de la page d'accueil</strong> si la carte peut &ecirc;tre affich&eacute;e et quand.
        Cinq possibilit&eacute;s sont propos&eacute;es :</p>
      <ul>
        <li>1 - Carte seulement (le tableau g&eacute;n&eacute;ral ne peut plus &ecirc;tre affich&eacute;
          par les visiteurs mais reste accessible aux administrateurs) </li>
        <li>2 - Tableau seulement (la carte n'est jamais affich&eacute;e ni affichable)</li>
        <li>3 - Carte affich&eacute;e et tableau masqu&eacute; (la carte est affich&eacute;e par
          d&eacute;faut mais on peut faire appara&icirc;tre le tableau en cliquant sur le mot
          "Tableau" en haut de la page) </li>
        <li>4 - Tableau affich&eacute; et carte masqu&eacute;e (Le tableau est affich&eacute; par
          d&eacute;faut mais on peut voir la carte en cliquant sur le mot "Carte" en
          haut de la page) </li>
        <li>5 - Carte et tableau affich&eacute;s (Les deux &eacute;l&eacute;ments sont toujours
          affich&eacute;s, la carte d'abord, le tableau ensuite). </li>
      </ul>
      <p align="left">Les quatre param&egrave;tres suivants d&eacute;terminent les
        caract&eacute;ristiques de la carte globale lorsqu'elle est affich&eacute;e :</p>
      <ul>
        <li><strong>Hauteur de la carte en pixels </strong><a href="http://127.0.0.1/LDEV3/actes/admin/gest_params.php?grp=G%E9oloc">(</a>GEO_HAUT_CARTE)
          : La valeur classique est de 500 pixels. Vous pouvez agrandir ou
          r&eacute;duire cette valeur mais il est prudent de rester dans la fourchette
          400 &agrave; 700 pixels. La largeur est d&eacute;termin&eacute;e automatiquement pour
          occuper toute la largeur libre de la page.</li>
        <li><strong>Niveau de zoom initial </strong><a href="http://127.0.0.1/LDEV3/actes/admin/gest_params.php?grp=G%E9oloc"></a>(GEO_ZOOM_INITIAL)
          : D&eacute;termine le niveau de zoom &agrave; l'affichage de la carte (g&eacute;n&eacute;ralement
          entre 6 et 11). Par d&eacute;faut, cette valeur est &agrave; 0 et laisse donc le
          syst&egrave;me d&eacute;terminer lui-m&ecirc;me le niveau de zoom permettant de voir
          toutes les donn&eacute;es sur la carte. Cependant lorsque la base comporte
          quelques d&eacute;pouillement "exotiques", tr&egrave;s &eacute;loign&eacute;s de la r&eacute;gion
          principale, l'affichage de la carte peut &ecirc;tre trop g&eacute;n&eacute;ral et il y a
          lieu de pr&eacute;ciser le niveau de zoom. Il est alors conseill&eacute; de
          commencer avec la valeur 10 puis d'ajuster si besoin &agrave; une valeur plus
          petite ou plus grande.</li>
        <li><strong>Centrage forc&eacute; de la carte sur </strong><a href="http://127.0.0.1/LDEV3/actes/admin/gest_params.php?grp=G%E9oloc"></a>(GEO_CENTRE_CARTE)
          : Compl&eacute;mentaire du param&egrave;tre pr&eacute;c&eacute;dent, celui-ci permet de "centrer"
          la carte initiale sur une localit&eacute; pr&eacute;d&eacute;termin&eacute;e qui doit &ecirc;tre une des
          communes ou paroisses g&eacute;olocalis&eacute;es. Cette localisation servira
          &eacute;galement de base pour la d&eacute;finition des coordonn&eacute;es non trouv&eacute;es par
          Google.</li>
        <li><strong>Niveau de zoom d&eacute;groupage </strong><a href="http://127.0.0.1/LDEV3/actes/admin/gest_params.php?grp=G%E9oloc"></a>(GEO_ZOOM_DEGROUPAGE)
          : Une carte comportant trop de "punaises" devient illisible. Pour
          &eacute;viter cela un m&eacute;canisme regroupe les localit&eacute;s proches en "groupes"
          et indique le nombre de localit&eacute;s pr&eacute;sentes. Toutefois, dans les vues
          d&eacute;taill&eacute;es ce m&eacute;canisme peut se r&eacute;v&eacute;ler d&eacute;sagr&eacute;able en regroupant deux
          localit&eacute;s tr&egrave;s proches sans plus apporter d'avantage. Il est donc
          int&eacute;ressant de pr&eacute;ciser le niveau de zoom en dessous duquel les points
          seront toujours d&eacute;group&eacute;s. Ordinairement une valeur entre 10 &agrave; 12 est
          un bon choix.</li>
      </ul>
      <h5><a id="GEO_LOCALITE" name="GEO_LOCALITE"></a>Affichage des cartes de
        localisation individuelles</h5>
      <p align="left">Le param&egrave;tre <strong>G&eacute;olocalisation des localit&eacute;s</strong>
        (GEO_LOCALITE) contr&ocirc;le l'affichage des liens vers la page de
        localisation individuelle de chaque localit&eacute; &agrave; partir des tables
        patronymiques. NB : Pour &eacute;viter qu'une "localit&eacute;" particuli&egrave;re soit
        localis&eacute;e, il suffit de mettre &agrave; 0 ses deux coordonn&eacute;es.</p>
    </blockquote>
    <blockquote>
      <p> &nbsp; </p>
    </blockquote>
    <h4><a id="Mail" name="Mail"></a>Envoi de courrier &eacute;lectronique (onglet
      Mail)</h4>
    <blockquote>
      <h5><a id="EXTERN_MAIL" name="EXTERN_MAIL"></a>Choix du mode de gestion
        des mails</h5>
      <p align="left">Le logiciel peut envoyer des email lors de la cr&eacute;ation des
        comptes d'utilisateur pour avertir ceux-ci du code de login et du mot de
        passe qui leur a &eacute;t&eacute; attribu&eacute;.<br />
        <br />
        <strong>Toutefois, cette fonctionnalit&eacute; d&eacute;pend de fa&ccedil;on crucialle de la
          possibilit&eacute; de se connecter &agrave; un serveur SMTP</strong> qui jouera le
        r&ocirc;le de relais pour l'envoi effectif des emails (comme la bo&icirc;te au
        lettres de la poste dans le courrier traditionnel).</p>
      <p align="left">La plupart des h&eacute;bergements fournissent cette possibilit&eacute;
        en standard dans la configuration PHP (fonction mail()). Il n'y a donc
        pas de configuration sp&eacute;cifique &agrave; r&eacute;aliser. Toutefois, si le serveur PHP
        n'offre pas la fonction mail, il est souvent possible d'utiliser un
        compte mail externe. Dans tous les cas, il faut pr&eacute;ciser l'adresse email
        de l'administrateur :</p>
      <ul>
        <li><strong>Votre adresse mail (adresse d'envoi et de r&eacute;ponse par
            d&eacute;faut)</strong> [LOC_MAIL] : <br />
          Votre propre adresse e-mail. Cette adresse est utilis&eacute;e pour
          identifier l'exp&eacute;diteur du mail et le cas &eacute;chant, elle est transform&eacute;e
          en destinataire en cas de r&eacute;ponse au mail. C'est aussi &agrave; cette adresse
          que seront adress&eacute;s les mails relatifs &agrave; l'autoinscription des
          utilisateurs.</li>
        <li><strong>Envoyer les mails via un serveur externe</strong>
          [EXTERN_MAIL] :<br />
          S'il est activ&eacute;, ce param&egrave;tre indique au logiciel qu'il ne peut faire
          appel &agrave; la fonction mail int&eacute;gr&eacute;e de PHP qui est normalement
          pr&eacute;configur&eacute;e par l'h&eacute;bergeur. Il est alors n&eacute;cesssaire de configurer
          les autres param&egrave;tres pour utiliser un compte mail personnel dont le
          serveur SMTP doit cependant &ecirc;tre accessible au d&eacute;part du lieu
          d'h&eacute;bergement. </li>
      </ul>
      <p><strong>Quel que soit le mode s&eacute;lectionn&eacute;, il est vivement conseill&eacute; de
          v&eacute;rifier que le syst&egrave;me peut envoyer des emails sans probl&egrave;me</strong>.
        Pour cela, un lien est propos&eacute; en bas des param&egrave;tres relatifs au Mail
        pour envoyer un email de test vers l'adresse de votre choix. </p>
      <h5><a id="SMTP_HOST" name="SMTP_HOST"></a>Param&egrave;tres de serveur de mails
        externe</h5>
      <p align="left">Lorsque le param&egrave;tre pr&eacute;c&eacute;dent est coch&eacute;, les param&egrave;tres
        du compte mail doivent alors &ecirc;tre pr&eacute;cis&eacute;s explicitement. <br />
        Si vous poss&eacute;dez un compte mail chez cet h&eacute;bergeur, les param&egrave;tres de ce
        compte doivent &ecirc;tre utilis&eacute;s de pr&eacute;f&eacute;rence.</p>
      <ul>
        <li><strong>Serveur SMTP</strong> [SMTP_HOST] : <br />
          Adresse du serveur SMTP. Ce serveur doit &ecirc;tre accessible &agrave; partir du
          lieu d'h&eacute;bergement. En effet, il est courant que pour limiter le spam,
          certains serveurs SMTP refusent d'acheminer des courrier &eacute;lectroniques
          qui ne sont pas &eacute;mis &agrave; partir d'un r&eacute;seau d&eacute;termin&eacute;.</li>
        <li><strong>Login du compte mail</strong> [SMTP_ACC] : <br />
          Votre code d'acc&egrave;s pour le compte mail (si le serveur SMTP exige une
          authentification de l'utilisateur) </li>
        <li><strong>Mot de passe du compte SMTP</strong> [SMTP_PASS] : <br />
          Votre mot de passe pour le compte mail (si le serveur SMTP exige une
          authentification de l'utilisateur)</li>
        <li><strong>Nom du serveur d'origine des mails</strong> [LOC_HOST] : <br />
          Nom du serveur local exp&eacute;diant les mails. C'est donc le nom de la
          machine qui contient le site. A d&eacute;faut de la conna&icirc;tre, il convient de
          donner le nom de domaine du site web (exemple www.truc.com) </li>
      </ul>
      <h5><a id="SIGNERR" name="SIGNERR"></a>Mail pour l'envoi des signalements
        d'erreurs </h5>
      <p>Il peut &ecirc;tre int&eacute;ressant de laisser la possibilit&eacute; aux visiteurs de
        signaler les erreurs qu'ils auraient constat&eacute;s dans la transcription
        d'une acte et ce soit suite &agrave; la lecture de l'acte original dans des
        archives, soit en d&eacute;chiffrant l'acte dont une copie scann&eacute;e est
        accessible via un lien ad hoc. </p>
      <p>Pour cela, il suffit de compl&eacute;ter pr&eacute;ciser une adresse email dans le
        param&egrave;tre <strong>Mail pour signalements d'erreur</strong>
        [EMAIL_SIGN_ERR]. Un lien vers une page permettant de noter la
        description de l'erreur sera alors ajout&eacute;e sous chaque acte (en mode
        visiteur). Cette page comprend aussi des zones pour lire les nom et
        pr&eacute;nom ainsi que le maild e la personne qui signale l'erreur. Enfin, si
        le param&egrave;tre <span id="aide4">AUTO_CAPTCHA</span> est activ&eacute; (voir la <a
          href="#USER_AUTO_DEF">section
          Utilisateurs</a>), une image pr&eacute;sente un code &agrave; transcrire afin
        d'emp&ecirc;cher la g&eacute;n&eacute;ration de mail par des robots. Si besoin, il est
        possible de noter plusieurs adresses mails en les s&eacute;parant par des
        virgules. </p>
      <p>Le mail envoy&eacute; au destinataire comprend un lien direct vers l'acte
        concern&eacute; de fa&ccedil;on &agrave; permettre une mise &agrave; jour rapide et facile des
        donn&eacute;es. </p>
      <h5><a id="CONTACT" name="CONTACT"></a>Mail pour le formulaire de contact</h5>
      <p>Pour &eacute;viter de publier l'adresse mail du gestionnaire de la base, il
        est possible d'activer un formulaire de contact qui permet ainsi &agrave; tout
        visiteur d'envoyer un message au webmaster sans conna&icirc;tre son adresse
        email. De plus le formulaire est prot&eacute;g&eacute; par la m&eacute;thode du code captcha
        (voir la <a href="#USER_AUTO_DEF">section Utilisateurs</a>) qui emp&ecirc;che
        l'envoi automatis&eacute; de messages via ce formulaire.</p>
      <p>Pour activer le formulaire, il suffit de pr&eacute;ciser l'adresse mail du
        destinataire dans le param&egrave;tre <strong>Mail destinataire du formulaire
          de contact</strong> [EMAIL_CONTACT].</p>
      <h5><a id="TEXTESMAIL" name="TEXTESMAIL"></a>Mails par d&eacute;faut pour la
        gestion des utilisateurs</h5>
      <p>Lors de cr&eacute;ation des comptes utilisateurs, il est n&eacute;cessaire d'envoyer
        diff&eacute;rents courriers &eacute;lectroniques vers les candidats utilisateurs
        notamment pour les informer des codes login et mots de passe ou encore
        pour les inviter &agrave; activer leur compte. Les param&egrave;tres qui suivent
        permettent de pr&eacute;ciser le texte automatique de ces mails. Dans chacun
        d'eux il est possible de faire ins&eacute;rer automatiquement certaines
        informations en mentionnant les codes suivants qui seront remplac&eacute;s
        sp&eacute;cifiquement dans chaque mail envoy&eacute; :</p>
      <ul>
        <li>#NOMSITE# : Nom du site web; </li>
        <li>#URLSITE# : Adresse internet du site, permettant de faciliter la
          connexion de l'utilisateur;</li>
        <li>#NOM# et #PRENOM# : Nom et pr&eacute;nom de l'utilisateur;</li>
        <li>#LOGIN# et #PASSW# : Code de login et mot de passe attribu&eacute; &agrave; cet
          utilisateur.</li>
      </ul>
      <p>Les textes par d&eacute;faut ou automatiques sp&eacute;cifiables sont :</p>
      <ul>
        <li><strong>Message &agrave; un nouvel utilisateur</strong> [MAIL_NEWUSER] : <br />
          Ce texte est utilis&eacute; &agrave; la fois pour la cr&eacute;ation manuelle des nouveaux
          utilisateurs ainsi que pour la cr&eacute;ation automatis&eacute;s par import d'une
          liste de noms et adresses mail. Ce texte peut &ecirc;tre modifi&eacute; par
          l'administrateur au moment de l'ajout ou de l'import.</li>
        <li><strong>Message de demande d'activation SANS validation</strong>
          [MAIL_AUTOUSER] : <br />
          Texte automatique du mail envoy&eacute; aux candidats utilisateurs qui
          viennent de cr&eacute;er spontan&eacute;ment leur compte d'acc&egrave;s. Ce mail convient
          lorsque le compte est imm&eacute;diatement actif sans n&eacute;cessiter de
          validation par l'administrateur;<br />
          Attention &agrave; bien y laisser le code #URLVALID# qui donne l'adresse du
          lien permettant l'activation du compte. Le code #KEYVALID# permet de
          rappeler la cl&eacute; d'activation. </li>
        <li><strong>Message de demande d'activation AVEC validation</strong>
          [MAIL_VALIDUSER] : <br />
          Semblable au pr&eacute;c&eacute;dent ce mail contient une phrase de plus pour
          informer le candidat utilisateur que sa demande devra &ecirc;tre valid&eacute;e par
          une administrateur;</li>
        <li><strong>Message d'approbation d'un utilisateur</strong>
          [MAIL_APPROBATION] : <br />
          Texte par defaut du mail envoy&eacute; aux utilisateurs lors de l'approbation
          de leur compte. Ce texte est modifiable par l'administrateur au moment
          de l'approbation;</li>
        <li><strong>Message de refus d'un utilisateur</strong> [MAIL_REFUS] : <br />
          Texte par defaut du mail envoy&eacute; aux utilisateurs lors du refus de leur
          compte. Ce texte est modifiable par l'administrateur au moment du
          refus;</li>
      </ul>
    </blockquote>
    <h4><a id="protection" name="Protection"></a>Gestion des m&eacute;canismes de
      protection (onglet Protection)</h4>
    <blockquote>
      <h5> <a id="MLOGIN" name="MLOGIN"></a>Contr&ocirc;le des logins</h5>
      <p>Un maximum d'efforts a &eacute;t&eacute; r&eacute;alis&eacute; pour s&eacute;curiser au maximum la base de
        donn&eacute;es. S'il advenait qu'un utilisateur parvienne &agrave; se connecter avec
        un des comptes de plus haut niveau, il serait int&eacute;ressant de le savoir
        le plus t&ocirc;t possible. C'est ce que permet le param&egrave;tre " <strong>Niveaux
          avec login confirm&eacute; par mail" </strong> [LEVEL_MAIL_LOGIN]. Ce
        param&egrave;tre indique le niveau &agrave; partir duquel le login est
        syst&eacute;matiquement confirm&eacute; par l'envoi d'un mail &agrave; son propri&eacute;taire. En
        selectionnant le niveau 10, aucun niveau ne re&ccedil;oit ce genre d'email. </p>
      <h5><a id="TIP" name="TIP"></a>Filtrage des adresses IP</h5>
      <p align="left">A la demande de plusieurs utilisateurs, un m&eacute;canisme de
        protection contre les syst&egrave;mes d'aspiration de sites a &eacute;t&eacute; int&eacute;gr&eacute;. Il
        s'agit en fait d'une version adapt&eacute;e et enrichie du module "TraceIP v2"
        propos&eacute; sur le site <a href="http://www.php-astux.info">www.php-astux.info</a>.</p>
      <p align="left"><strong>Le module de protection N'EST PAS ACTIF PAR DEFAUT</strong>.
        Pour l'activer, il suffit de s&eacute;lectionner l'une des options 1 ou 2 du
        param&egrave;tre "<strong>Utiliser l'anti-aspirateur IP</strong>" dans l'onglet
        "Protection" du param&eacute;trage. Les deux variantes sont expliqu&eacute;es un peu
        plus loin.<br />
        <br />
        <strong>Cette fonctionnalit&eacute; n&eacute;cessite que la configuration mail soit
          correcte afin de transmettre les alertes lorqu'un abus est d&eacute;tect&eacute;.</strong></p>
      <p align="left">Le principe de fonctionnement est simple. Pour chaque
        requ&ecirc;te re&ccedil;ue, le logiciel m&eacute;morise l'adresse IP du demandeur et v&eacute;rifie
        si cette adresse a d&eacute;j&agrave; effectu&eacute; des requ&ecirc;tes au cours d'une p&eacute;riode
        pr&eacute;d&eacute;finie. Si c'est le cas, un compteur est augment&eacute; d'une unit&eacute; &agrave;
        chaque requ&ecirc;te. Lorsque le compteur d&eacute;passe la valeur limite fix&eacute;e par
        le parm&egrave;tre "<strong>Nombre maximum par p&eacute;riode</strong>" alors
        l'adresse IP est automatiquement bannie : toute requ&ecirc;te suivante est
        alors interdite et retourne le message qui se trouve dans "<strong>Texte
          renvoy&eacute; aux IP bannies</strong>".</p>
      <p align="left">Les deux variantes possibles dans la protection sont les
        suivantes :</p>
      <ul>
        <li><strong>1 - Compter toutes les pages</strong> : Avec ce
          choix, toutes les pages vues par les visiteurs sont prises en compte.
          Cela &agrave; pour inconv&eacute;nient qu'un visiteurs qui parcourt rapidement les
          listes de tables peut attendre le maximum sans pour autant avaoir
          l'impression d'avoir abus&eacute;.</li>
        <li><strong>2 - Compter les actes seulement</strong> :
          Cette option ne prend plus en compte que la visualisation des actes
          d&eacute;taill&eacute;s. Ici seul ceux qui affichent beaucoup d'actes sont bloqu&eacute;s.</li>
      </ul>
      <p>Le param&egrave;tre "<strong>Dur&eacute;e de la p&eacute;riode en minutes</strong>" est
        important pour d&eacute;finir la longueur de la p&eacute;riode consi&eacute;d&eacute;r&eacute;e pour la
        mesure. Cette p&eacute;riode est exprim&eacute;e en minutes. On peut choisir une
        p&eacute;riode tr&egrave;s courte (1 minute) mais il est plus int&eacute;ressant de prendre
        une p&eacute;riode plus longue telle qu'une journ&eacute;e (1440 minutes). En effet,
        limiter &agrave; 10 actes par minute permettrait &agrave; un robot bien r&eacute;gl&eacute; de lire
        10x 1440 = 14.400 actes en 24h alors que d'autoriser 200 ou 300 actes en
        une journ&eacute;e est suffisant pour tout utilisateur "normal".</p>
      <p>Pour &eacute;viter de p&eacute;naliser les visiteurs normaux qui approchent de la
        limite, une possibilit&eacute; d'afficher un texte d'avertissement a &eacute;t&eacute;
        ajout&eacute;e. Pour l'activer, il faut tout d'abord indiquer le nombre de
        pages qui comporteront un message d'alerte avant blocage dans la case "<strong>Nbre
          d'alertes avant blocage</strong>". Une valeur repr&eacute;sentant 20 &agrave; 30 %
        du nombre maximum semble indiqu&eacute;e. Ensuite, il est possible de modifier
        le texte d'avertissement pr&eacute;sent dans la case "<strong>Texte d'alerte
          avant blocage</strong>". Enfin, il est possible de choisir le mode
        d'avertissement via le param&egrave;tre <strong>Mode d'affichage des alertes </strong>
        :</p>
      <ul>
        <li>1 : Message de couleur rouge affich&eacute; en haut de page;</li>
        <li>2 : Bo&icirc;te de dialogue javascript avec bouton OK &agrave; cliquer
          obligatoirement;</li>
        <li>3 : Combinaison des deux m&eacute;thodes pr&eacute;c&eacute;dentes.</li>
      </ul>
      <p>Enfin, comme les adresses IP distribu&eacute;es par les fournisseurs d'acc&egrave;s
        Internet ne sont en g&eacute;n&eacute;ral pas fixe, un utilisateur ne garde son
        adresse IP que pendant 2 ou 3 jours. Il n'est donc pas n&eacute;cessaire de
        maintenir le blocage pendant un temps plus long. Le param&egrave;tre "<strong>Dur&eacute;e
          du blocage en jours</strong>" permet ainsi de pr&eacute;ciser le nombre de
        jours pendant lequel le blocage est maintenu. La valeur 0 provoque le
        blocage permanent. Notons que, m&ecirc;me lorsque l'acc&egrave;s est bloqu&eacute;, le
        nombre de tentative d'acc&egrave;s continue &agrave; &ecirc;tre comptabilis&eacute;. Cela explique
        que l'on trouve un nombre d'acc&egrave;s sup&eacute;rieur &agrave; la limite maximale. S'il
        s'agit d'un utilisteur ordinaire, celui-ci tentera toujours quelques
        fois d'acc&eacute;der &agrave; d'autres actes puis s'arretera tr&egrave;s vite. Par contre,
        s'il s'agit d'un robot, il ne s'arr&ecirc;tera pas et le nombre peut d&eacute;passer
        de beaucoup la valeur limite. Aussi,<strong> le d&eacute;blocage automatique
          n'a pas lieu lorsque le nombre d'acc&egrave;s est sup&eacute;rieur au double du
          nombre autoris&eacute;</strong>. </p>
      <p>Par ailleurs, le filtrage des adresses IP est en principe actif pour
        tous les utilisateurs enregistr&eacute;s ou pas. Il peut cependant &ecirc;tre utile
        d'exempter les d&eacute;posants de cette v&eacute;rification pour ne pas risquer de
        les bloquer lors d'un usage un peu trop rapide, d'autant plus probable
        que connaissant bien le logiciel, ces dernier l'utilisent plus
        rapidement. Pour cela il suffit de s&eacute;lectionner le niveau d'acc&egrave;s &agrave;
        partir duquel l'exemption a lieu dans la case "<strong>Niveaux exempt&eacute;s
          du contr&ocirc;le IP</strong>". Il est toutefois &agrave; noter qu'&agrave; partir de la
        version 3.2, le niveau 5 est toujours exempt&eacute; du contr&ocirc;le IP. Cette
        facilit&eacute; est destin&eacute;e aux membres des clubs qui peuvent ainsi avoir un
        acc&egrave;s &eacute;tendu aux actes.</p>
      <p>A ce comportement natif du module TraceIP, nous avons ajout&eacute; une
        possibilit&eacute; d'outrepasser cette protection pour certaines adresses IP ou
        certains "Agent". En effet, les moteurs de recherches tels que Google,
        Yahoo, MSN, etc acc&egrave;dent aussi r&eacute;guli&egrave;rement aux pages des sites
        Expoactes et peuvent &ecirc;tre bannis s'ils d&eacute;passent une certaine cadence de
        visite. Pour &eacute;viter ce probl&egrave;me, il est possible de d&eacute;tecter ces moteurs
        d'indexation (dit aussi "robots" ou simplements "bots") gr&acirc;ce &agrave; la
        signature de l'"agent" qu'ils fournissent automatiquement. Voir &agrave; ce
        sujet la liste des "agents" existant sur <a href="http://user-agents.org/">user-agents.org</a>
        . Il est donc possible de d&eacute;clarer les agents qui sont accept&eacute;s en
        copiant la signature (ou seulement une partie significative) dans le
        param&egrave;tre "<strong>Agents affranchis</strong>". Si plusieurs agents sont
        accept&eacute;s, il faut s&eacute;parer les signatures par des VIRGULES. </p>
      <blockquote>
        <p align="left">Exemple :
          "+http://www.google.com/bot.html;,http://help.yahoo.com/help/us/ysearch/slurp;"
          autorise les robots de Google et de Yahoo. </p>
      </blockquote>
      <p align="left">Pour suivre facilement les agents qui re&ccedil;oivent un libre
        acc&egrave;s, il suffit de cocher la case "<strong>M&eacute;moriser les IP
          auto-affranchies</strong>" pour que celles-ci appraissent dans le
        liste des adresses IP affich&eacute;es par l'&eacute;cran d'administration.</p>
      <p align="left">Lorsqu'une adresse IP est bannie, le logiciel envoie un
        message email &agrave; un adminstrateur dans l'adresse sera pr&eacute;cis&eacute;e dans le
        param&egrave;tre "<strong>Destinataire du mail d'alerte</strong>". Ce mail
        contient toutes les informations disponibles sur la derni&egrave;re page
        consult&eacute;e et sur l'adresse IP demandeuse. De plus, un lien en fin de
        mail donne acc&egrave;s &agrave; l'&eacute;cran d'administration des IP bannies. Il est alors
        possible &agrave; l'administrateur de supprimer le bannissement ou d'affranchir
        l'adresse bannie.</p>
      <p align="left">L'&eacute;cran d'administration, accessible via le menu
        "Administrer le logiciel" puis "Filtrage IP" dresse le liste des
        adresses IP stock&eacute;es dans la base de donn&eacute;es. Selon la couleur
        d'affichage, on distingue trois cat&eacute;gories :</p>
      <ul>
        <li>Affichage en noir : Adresses IP ayant acc&eacute;d&eacute; au site dans la minute;
        </li>
        <li>Affichage en rouge : Adresses IP bannies avec date et heure du
          bannissement; </li>
        <li>Affichage en vert : Adresses IP affranchie soit manulellement, soit
          automatiquement via la liste des agents affranchis. </li>
      </ul>
      <p>Lorsque le visiteur est identifi&eacute; par un login, ce code est aussi
        ajout&eacute; dans la liste. Il faut toutefois noter qu'un utilisateur peut se
        connecter tour &agrave; tour avec plusieurs logins sur un m&ecirc;me ordinateur donc
        avec une m&ecirc;me IP. Invers&eacute;ment, il est possible qu'un m&ecirc;me login soit
        utilis&eacute; via plusieurs ordinateurs diff&eacute;rents donc via des IP
        diff&eacute;rentes. Pour toutes ces raisons, le login qui est associ&eacute; &agrave; une IP
        est le dernier utilis&eacute; via cette IP. (ajout&eacute; &agrave; la version 3.1.2)</p>
      <p>Les liens permettent d'affranchir manuellement une adresse libre ou
        bannie ou de supprimer une adresse de la liste (ce qui supprime son
        statit d'affranchie ou de bannie).</p>
      <p>Un lien sp&eacute;cifique permet de supprimer d'un coup toutes les adresses
        affranchies automatiquement (via la liste des agents affranchis) mais
        qui n'ont en fait &eacute;t&eacute; utilis&eacute;eq qu'un tr&egrave;s petit nombre de fois. Cela
        all&egrave;ge la liste et facilite le contr&ocirc;le.</p>
    </blockquote>
    <h4 align="left"><a id="Recherche" name="Recherche"></a>Recherche des
      donn&eacute;es (onglet Recherche)</h4>
    <blockquote>
      <h5><a id="CHERCH_TS_TYP" name="CHERCH_TS_TYP"></a>Recherches de base et
        avanc&eacute;es</h5>
      <p>Par d&eacute;faut, les recherches s'effectuent dans la base de donn&eacute;es avec
        les outils standards de MySQL. La fa&ccedil;on dont s'effectue ces recherches
        peut &ecirc;tre contr&ocirc;l&eacute; par les param&egrave;tres suivants :</p>
      <ul>
        <li><strong>Recherche par d&eacute;faut sur tous types d'actes</strong>
          [CHERCH_TS_TYP] : <br />
          Cette option, lorsqu'elle n'est pas activ&eacute;e, provoque l'affichage
          d'une liste de s&eacute;lection du type des actes dans la bo&icirc;te de recherche
          de la page d'accueil. Elle limite aussi les recherches avanc&eacute;es et
          levenshtein &agrave; un seul type d'acte &agrave; la fois. Cette option permet donc
          d'all&eacute;ger le travail du moteur de recherche. </li>
        <li><strong>Comparaison propos&eacute;e par d&eacute;faut</strong> [RECH_DEF_TYP] : <br />
          D&eacute;termine le mode de comparaison qui est propos&eacute; par d&eacute;faut pour la
          recherche avanc&eacute;e. Les deux premiers sont nettement plus &eacute;conomes en
          ressources serveur que les trois suivants car ils exploient les index.
          Lorsque la base est importante, il est conseill&eacute; de pr&eacute;s&eacute;lectionner ce
          mode car, pour la mojorit&eacute; des recherches il economise les ressources
          du serveur et acc&eacute;l&egrave;re la traitement.</li>
        <li><strong>Longueur minimale du mot recherch&eacute;</strong> [RECH_MIN] : <br />
          D&eacute;termine le nombre minimum de caract&egrave;res sur lesquels doit porter une
          recherche. <br />
          Par d&eacute;faut, RECH_MIN vaut 3.<br />
          Notez que l'administrateur principal n'est pas soumis &agrave; cette
          restriction.</li>
      </ul>
      <h5><a id="RECH_LEVENSHTEIN" name="RECH_LEVENSHTEIN"></a>Recherches par la
        m&eacute;thode Levenshtein</h5>
      <p>La m&eacute;thode de recherche avanc&eacute;e "sonore" ne permet pas toujours de
        trouver ceertains actes comportant des erreurs d'encodage et ce
        particuli&egrave;rement si le lettre initiale est incorrecte. Pour r&eacute;soudre ce
        probl&egrave;me<strong> Jean-Louis Cazor</strong> a eu l'id&eacute;e d'impl&eacute;menter un
        autre algorithme se basant sur <a href="levenshtein_principes.html">la
          m&eacute;thode Levenshtein</a>. Cet algorithme est tr&egrave;s puissant mais
        malheureusement tr&egrave;s gourmand en ressouces machine. Il cr&eacute;e en effet des
        tables de donn&eacute;es interm&eacute;diaires et effectue de nombreux calculs sur les
        informations pr&eacute;lectionn&eacute;es. Il convient d&egrave;s lors de le reserver aux
        utilisateurs avertis et de <a href="levenshtein_utilisation.html">suivre
          les conseils d'utilisation pr&eacute;cis&eacute;s par Jean-Louis</a>. </p>
      <p>Par d&eacute;faut cet algorithme est activ&eacute; mais seulement accessible aux
        administrateurs. La mise &agrave; disposition de cet algorithme est contr&ocirc;l&eacute;e
        par trois param&egrave;tres facultatifs :</p>
      <ul>
        <li><strong>Activation de la recherche Levenshtein</strong>
          [RECH_LEVENSHTEIN] :<br />
          Ce param&egrave;tre indique si l'algorithme est actif et si c'est le cas, où
          doit appara&icirc;tre le lien vers la page de recherche sp&eacute;cifique. Les
          valeurs possibles sont :
          <ul>
            <li>0 : la recherche levenshtein est totalement d&eacute;sactiv&eacute;e (et donc
              interdite &agrave; tout utilisateur);</li>
            <li>1 : la recherche levenshtein est active et accessible via un
              lien situ&eacute; dans la page de recherche avanc&eacute;e;</li>
            <li>2 : la recherche levenshtein est active et accessible via un
              lien situ&eacute; dans la bo&icirc;te de recherche rapide;</li>
          </ul>
        </li>
        <li><strong>Niveau d'acc&egrave;s pour la rech. Levenshtein</strong>
          [LEVEL_LEVENSHTEIN] :<br />
          Ce param&egrave;tre d&eacute;termine le niveau d'acc&egrave;s n&eacute;cessaires aux utilisateurs
          pour pouvoir utiliser la recherche levenshtein. Par d&eacute;faut, ce niveau
          est 8 afin de r&eacute;server l'usage aux administrateurs seulement. Ce
          niveau ne peut pas &ecirc;tre inf&eacute;rieur au niveau PUBLIC_LEVEL.</li>
        <li><strong>Secondes r&eacute;serv&eacute;e pour terminer une recherche</strong>
          [SECURITE_TIME_OUT_PHP] : <br />
          La recherche levenshtein peut n&eacute;cessiter plusieurs dizaines de seconde
          de calcul lorsque la requ&ecirc;te est trop vague. Or la plupart des
          serveurs limitent le temps de calcul (souvent &agrave; 30 sec) puis
          abandonnent la t&acirc;che. Pour &eacute;viter cela, le param&egrave;tre
          SECURITE_TIME_OUT_PHP sp&eacute;cifie le nombre de seconde de s&eacute;curit&eacute; que le
          syst&egrave;me se r&eacute;serve afin de stopper proporement la recherche et de
          signaler &agrave; l'utilisateur que sa recherche est trop complexe.<br />
          Par d&eacute;faut, SECURITE_TIME_OUT_PHP vaut 5.</li>
        <li><strong>Etendue des recherches sur les couples</strong>
          [CRIT_RECH_COUPLES] :<br />
          Ce param&egrave;tre permet d'&eacute;tendre ou de restreindre les possibilit&eacute;s de
          recherches sur les couples. Les valeurs peuvent aller de 2 &agrave; 4 :
          <ul>
            <li>2 : Autorise la recherche des mariages de ces couples et des
              naissances des enefants de ces couples;</li>
            <li>3 : Idem 2 + les d&eacute;c&egrave;s des enfants de ces couples ;</li>
            <li>4 : Idem 3 + recherches des mariages d'enfants de ces couples;</li>
          </ul>
        </li>
      </ul>
      <h5><a id="geneanet" name="geneanet"></a>Liste &eacute;clair "G&eacute;n&eacute;anet"</h5>
      <p>Pour faciliter le r&eacute;f&eacute;rencement de vos actes dans le moteur de
        recherche de G&eacute;n&eacute;anet, un dispositif de g&eacute;n&eacute;ration automatique de
        liste-&eacute;clair a a &eacute;t&eacute; adjoint au logiciel. Il est accessible via l'URL <a
          href="../../eclair.php">eclair.php</a>
        &agrave; la racine du site ExpoActes pour auatnt que cette inddexation soit
        autoris&eacute;es via le param&egrave;tre <strong>Publier la liste &eacute;clair pour
          G&eacute;n&eacute;anet </strong><a href="http://127.0.0.1/LDEV3/actes/admin/gest_params.php?grp=Recherche"></a>[ECLAIR_AUTORISE].
        </p>
      <p>La proc&eacute;dure produit une liste principale des communes avec le nombre
        d'actes puis pour chacune d'elles une liste des patronymes avec la
        premi&egrave;re ann&eacute;e, la derni&egrave;re ann&eacute;e et le nombre d'actes.</p>
      <table width="669" border="1">
        <caption> &nbsp; </caption>
        <tbody>
          <tr>
            <th width="399" scope="col">Liste principale </th>
            <th width="254" scope="col">Liste d&eacute;taill&eacute;es </th>
          </tr>
          <tr>
            <td>
              <ul>
                <li><a href="http://127.0.0.1/LDEV3/actes/eclair.php?xtyp=D&amp;xcom=Graide&amp;xdep=Namur">D&eacute;c&egrave;s
                    de Graide [Namur] </a> (657 actes) <strong>---------------&gt;</strong>
                </li>
                <li><a href="http://127.0.0.1/LDEV3/actes/eclair.php?xtyp=N&amp;xcom=Hanret&amp;xdep=Namur">Naissances
                    de Hanret [Namur] </a> (4281 actes) </li>
                <li><a href="http://127.0.0.1/LDEV3/actes/eclair.php?xtyp=N&amp;xcom=Incourt&amp;xdep=Brabant+Wallon">Naissances
                    de Incourt [Brabant Wallon] </a> (364 actes) </li>
                <li><a href="http://127.0.0.1/LDEV3/actes/eclair.php?xtyp=N&amp;xcom=L%27Ecluse&amp;xdep=Brabant+Wallon">Naissances
                    de L'Ecluse [Brabant Wallon] </a> (64 actes) </li>
              </ul>
            </td>
            <td>
              <blockquote>
                <p>...<br />
                  <br />
                  BADOT;1823;1899;14; <br />
                  BAETEN;1910;1910;1; <br />
                  BALOY;1688;1688;1; <br />
                  BARAS;1733;1896;120;</p>
                <p>...</p>
              </blockquote>
            </td>
          </tr>
        </tbody>
      </table>
      <p>Pour &eacute;viter de charger exag&eacute;r&eacute;ment le serveur lors de la production de
        ces listes, il est possible de les scinder en plusieurs parties gr&acirc;ce au
        param&egrave;tre <strong>Nombre maximum d'actes par liste &eacute;clair </strong><a
          href="http://127.0.0.1/LDEV3/actes/admin/gest_params.php?grp=Recherche"></a>[ECLAIR_MAX_ROW].</p>
      <p>Par ailleurs, il est possible de contr&ocirc;ler les acc&egrave;s qui sont effectu&eacute;s
        &agrave; cette liste &eacute;clair en obligeant, via le param&egrave;tre <strong>Journalisation
          des requ&ecirc;tes &eacute;clair</strong> [ECLAIR_LOG], le syst&egrave;me &agrave; journaliser
        les appels dans un fichier qui est stock&eacute; dans le r&eacute;pertoire _log. Pour
        que les fichiers ne soient pas trop gros, le nom du fichier change
        automatiquement chaque mois. Chaque ligne du fichier contient les
        informations suivantes, s&eacute;par&eacute;es par des points-virgules :</p>
      <ul>
        <li>date et heure;</li>
        <li>adresse IP du demandeur;</li>
        <li>type d'actes (N, D, M ou V ou vide pour la liste principale);</li>
        <li>commune;</li>
        <li>d&eacute;partement;</li>
        <li>initiale des patronymes (si la commune doit &ecirc;tre d&eacute;coup&eacute;e en
          plusieurs parties);</li>
        <li>nombre de lignes g&eacute;n&eacute;r&eacute;es;</li>
        <li>dur&eacute;e de la requ&ecirc;te en milli&egrave;mes de seconde;</li>
        <li>signature HTTP_USER_AGENT.</li>
      </ul>
    </blockquote>
    <h4><a id="Systeme" name="Systeme"></a>Param&egrave;tres globaux et divers (onglet
      Syst&egrave;me)</h4>
    <blockquote>
      <h5><a id="FULL_URL" name="FULL_URL"></a>Gestion des URL du logiciel
        lui-m&ecirc;me</h5>
      <ul>
        <li><strong>Affichage des URL sans arguments</strong> [FULL_URL] : <br />
          Ce param&egrave;tre permet - lorsque la configuration du serveur web
          l'autorise - &agrave; utiliser une notation des URL qui ne comporte pas de
          param&egrave;tres. Montrons cela par un exemple :
          <ul>
            <li>FULL_URL = 0 (d&eacute;sactiv&eacute;) :
               http://...votre_site.../actes/tab_naiss.php<span style="font-weight: bold;">?args=Graide,ALEN</span>
            </li>
            <li>FULL_URL = 1 (activ&eacute;) :
               http://...votre_site.../actes/tab_naiss.php<span style="font-weight: bold;">/Graide/ALEN</span></li>
          </ul>
        </li>
      </ul>
      <blockquote>
        <p>Certains moteurs de recherche n'indexent pas bien les URL qui
          comportent des arguments. Il faut donc pr&eacute;f&eacute;rer le mode FULL_URL = 1
          mais malheureusement cette possibilit&eacute; d&eacute;pend de la configuration du
          serveur web de l'h&eacute;bergeur. Si elle ne fonctionne pas, il faut
          utiliser la valeur 0.<br />
        </p>
      </blockquote>
      <h5><a id="URL_JPG" name="URL_JPG"></a>Gestion d'URL vers des images et
        des pages externes</h5>
      <p>En plus du d&eacute;pouillement d'un acte, il est souvent int&eacute;ressant de
        renvoyer vers l'image de l'acte (ou plusieurs images lorsque celui-ci
        compte plusieurs pages). A cette fin, plusieurs zones acceptent des
        contenus qui sont succeptibles de g&eacute;n&eacute;rer un lien vers ces images, ou le
        cas &eacute;ch&eacute;ant, vers tout autre document jug&eacute; int&eacute;ressant. </p>
      <p>Les zones qui acceptents ces liens sont les zones "LIBRE", "COTE",
        "COMGEN" (Commentaire g&eacute;n&eacute;ral) et la nouvelle zone "PHOTOS" ajout&eacute;e avec
        la version 3. Il existe toutefois une diff&eacute;rence entre les trois
        permi&egrave;res et la zone PHOTO au niiveau des s&eacute;parateurs. Pour les trois
        premi&egrave;res, les nom d'images ou d'URL peuvent &ecirc;tre s&eacute;par&eacute;s par des blancs
        ou des virgules comme dans un texte ordinaire. Dans la zone PHOTOS par
        contre, les chemins des photos ou les URL DOIVENT &ecirc;tre s&eacute;par&eacute;s par des
        points-vigules. Cette disposition permet &agrave; la fois de rester coh&eacute;rent
        avec le logiciel NIMEGUE et aussi d'admettre des chemins d'acc&egrave;s qui
        comprennent eux-m&ecirc;me des blancs.</p>
      <p>Ainsi, les contenus suivants :</p>
      <p align="center"><img width="758" height="249" src="url001.png" /></p>
      <p>Produisent l'affichage suivant : </p>
      <p align="center"><img width="654" height="74" src="url002.png" /></p>
      <p>Reste &agrave; d&eacute;terminer quelle URL est finalement g&eacute;n&eacute;r&eacute;e sous le lien
        actif. </p>
      <p><strong>Lien cr&eacute;&eacute; pour une URL </strong></p>
      <p>La premi&egrave;re possibilit&eacute; consiste &agrave; inclure directement une URL compl&egrave;te
        (c'est-&agrave;-dire commen&ccedil;ant par "http://" ou https://) pointant vers la
        page souhait&eacute;e. Dans ce cas, cette adresse est automatiquement d&eacute;tect&eacute;e
        et est transform&eacute;e en un lien actif qui pourra donc &ecirc;tre simplement
        cliqu&eacute; par le visiteur. Il n'y a pas de configuration particuli&egrave;re pour
        cette facilit&eacute;. A partir de la version 3.2, cette r&egrave;gle compte une
        exception lorsque le lien comporte la d&eacute;finition d'un iframe via une
        paire de balises &lt;iframe&gt; .... &lt;/iframe&gt;. Dans ce cas en
        effet, le bloc iframe est simplement restitu&eacute; comme tel et permet ainsi
        d'afficher directement l'image point&eacute;e par l'URL. </p>
      <p><strong>Liens vers des images d'actes</strong></p>
      <p>Il est aussi possible de cr&eacute;er des liens vers des images ayant l'une
        des extensions suiavntes : .JPG, .PNG, .TIF ou .PDF (par exemple
        "image0234.jpg". Il faut alors savoir où se trouve cette image. </p>
      <p>La premi&egrave;re possibilit&eacute; consiste &agrave; cr&eacute;er un r&eacute;pertoire /img_act/ &agrave; c&ocirc;t&eacute;
        du p&eacute;pertoire /actes/ qui contient le logiciel puis &agrave; placer les images
        dans ce r&eacute;pertoire /img_act/. Il n'y a alors rien d'autre &agrave; faire que de
        citer le nom du fichier image pour qu'un lien soit cr&eacute;&eacute;. </p>
      <blockquote>
        <p>Exemple : Si le site a pour adresse http://www.monsite.fr/actes, <br />
          alors l'image <strong>"acte_00012.jpg</strong>" va produire l'URL "<strong>http://www.monsite.fr/img_act/acte_00012.jpg</strong>"</p>
      </blockquote>
      <p>De plus, le nom de l'image peut &ecirc;tre pr&eacute;c&eacute;d&eacute; du nom d'un r&eacute;pertoire, ou
        m&ecirc;me d'un chemin, de fa&ccedil;on &agrave; regrouper ensemble par exemple les actes
        d'une m&ecirc;me commune (exemple : c02/img234.jpg, c03/img566.jpg).</p>
      <p>Si pour une raison quelconque, il n'est pas possible de cr&eacute;er ou
        d'utiliser un r&eacute;pertoire /img_act/ &agrave; la racine du site web, il est
        possible de pr&eacute;ciser, dans le param&egrave;tre URL_JPG d&eacute;crit ci-dessous, un
        autre r&eacute;pertoire plac&eacute; &agrave; la racine du m&ecirc;me site (exemple :
        /genealogie/mesimages/) ou l'URL compl&egrave;te d'un r&eacute;pertoire sur un autre
        site (exemple : http://www.imageur.com/magenealaogie/communes/). Ce
        pr&eacute;fixe sera utilis&eacute; pour g&eacute;n&eacute;rer le lien vers les images. </p>
      <p><strong>Images localis&eacute;es dans plusieurs sites web diff&eacute;rents </strong></p>
      <p>Devant la n&eacute;cessit&eacute; de g&eacute;rer de fa&ccedil;on nuanc&eacute;e les multipes cas qui
        peuvent se pr&eacute;senter, la version 3.0 introduit une notation plus
        compl&egrave;te pour la liste des <strong>URL des images d'actes</strong>
        [URL_JPG]. Cette doit comprendre, d'abord le chemin par d&eacute;faut des
        images d'actes locales au serveur dont nous venons de parler au
        paragr&eacute;phe pr&eacute;c&eacute;dente. Ensuite, et s&eacute;par&eacute;es les unes des autres par des
        points-virgules (;) on peut pr&eacute;ciser des expression comportant soit le
        symblole "&gt;" soit "&gt;&gt;". La signalifaction est la suivante :</p>
      <ul>
        <li><strong>&gt;</strong> signifie "ajouter, avant le nom des images
          comportant le code pr&eacute;c&eacute;dant le signe &gt;, l'URL suivante". <br />
          Par exemple "NAMUR&gt;http://www.site1.be/" signifie "lorsque le nom
          de l'image comporte "NAMUR", il faut ajouter devant ce nom
          "http://www.site1.be/" et donc l'image NAMUR/photo1234.jpg produit
          l'URL "http://www.site1.be/NAMUR/photo1234.jpg".<br />
        </li>
        <li><strong>&gt;&gt;</strong> signifie "remplacer le texte qui pr&eacute;c&egrave;de
          le code &gt;&gt; par celui qui le suit". <br />
          Par exemple "C:\mes
          images\genealogie\&gt;&gt;http://www.site1.be/actes/" aura pour effet
          de transformer le nom de la photo d'acte <br />
          "C:\mes images\genealogie\namur\photo1234.jpg" en
          "http://www.site1.be/actes/namur/photo1234.jpg".</li>
      </ul>
      <p>Les r&egrave;gles sont &eacute;nonc&eacute;es &agrave; la suite les une des autres dans la zone <strong>URL
          des images d'actes</strong> [URL_JPG] : </p>
      <p>Exemple : </p>
      <blockquote>
        <p>/img_act/;<br />
          NAMUR&gt;http://www.site1.be/;<br />
          C:\mes images\genealogie\&gt;&gt;http://www.site1.be/actes/;<br />
          JAMBES&gt;&gt;http://www.site3.be/actes/jbe;</p>
      </blockquote>
      <p><strong>Protection de l'acc&egrave;s aux images</strong></p>
      <p>Certains utilisateurs d'Expoactes, souhaitent r&eacute;server l'acc&egrave;s de tout
        ou partie des images &agrave; certains des visiteurs seulement. Le logiciel
        propose pour cela deux m&eacute;canismes :</p>
      <ul>
        <li>D'une part, il est possible de ne laisser voir les images que par
          les visiteurs connect&eacute;s (se preporter ici aux <a href="#ANNEE_TABLE">
            param&egrave;tres "Affichage"</a>)<br />
        </li>
        <li>D'autre part, il est possible de <strong>prot&eacute;ger l'acc&egrave;s &agrave;
            certaines images seulement</strong> en les pla&ccedil;ant dans un
          sous-r&eacute;pertoire qui doit comporter le mot "prive" dans son nom
          (exemple : /img_act/prive/ ou aussi /img_act/scan/prive/dinant/). Dans
          ce cas, le lien n'apparaitra que pour les personnes connect&eacute;es ayant
          le niveau d'acc&egrave;s sp&eacute;cifi&eacute; dans param&egrave;tres suivant. Il restera
          invisible pour les autres.</li>
      </ul>
      <ul>
        
          <li><strong>Niveau d'acc&egrave;s n&eacute;cessaire pour les images prot&eacute;g&eacute;es </strong>
            [LEVEL_JPG_PRIVE] : <br />
            Niveau d'acc&egrave;s n&eacute;cessaire pour obtenir le lien vers les images
            pr&eacute;sentes dans le ou les r&eacute;pertoires PRIVES.</li>
        
      </ul>
      <h5 align="left"><a id="UPLOAD_DIR" name="UPLOAD_DIR"></a>Chargement des
        fichiers CSV</h5>
      <ul>
        <li><strong>R&eacute;pertoire de stockage temporaire des
            chargements</strong> [UPLOAD_DIR] : <br />
          Les fichiers CSV t&eacute;l&eacute;charg&eacute;s pour l'ajout d'actes sont transf&eacute;r&eacute;s
          temporairement dans le r&eacute;pertoire "_upload" situ&eacute; lui-m&ecirc;me dans le
          r&eacute;pertoire "admin". Si l'h&eacute;bergement oblige &agrave; utiliser un autre
          r&eacute;pertoire pour les t&eacute;l&eacute;chargements, il faut alors sp&eacute;cifier le chemin
          d'acc&egrave;s de ce r&eacute;pertoire avec le param&egrave;tre UPLOAD_DIR</li>
      </ul>
      <h5 align="left"><a id="META_TAG" name="META_TAG"></a>Gestion des balises
        "meta tags"</h5>
      <ul>
        <li><strong>Personalisation de la description et des
            mots-cl&eacute;s </strong> [META_DESCRIPTION] et [META_KEYWORDS] : <br />
          Ces deux zones sont utilis&eacute;es par les moteurs de recherche pour
          qualifier et r&eacute;f&eacute;rencer votre site web. De fa&ccedil;on automatique Expactes
          ajoute dans ces deux zones le titre de la page qui varie
          automatiquement d'une page &agrave; l'autre en pr&eacute;cisant la commune ou le
          patronyme dont il est question. Il est possible de noter une
          description suppl&eacute;mentaire ainsi que des mots-cl&eacute;s sp&eacute;cifiques.</li>
        <li><strong>Autres &eacute;l&eacute;ments pour le header HTML</strong>
          [INCLUDE_HEADER] : <br />
          D'autre balises meta tags peuvent &ecirc;tre incluses dans la zone "header"
          pour donner des instructions plus pr&eacute;cises aux moteurs de recherche. <br />
          <em>Attention : ces &eacute;l&eacute;ments doivent respecter strictement la syntaxe
            xHTML.</em> </li>
      </ul>
      <h5 align="left"><a id="GOOGLEANA" name="GOOGLEANA"></a>Activation des
        statistiques Google Analytics </h5>
      <ul>
        <li><strong>ID de suivi Web Google Analytics</strong> [GOOGLE_ANA_CODE]
          :<span id="aide8"><br />
            Pour obtenir tr&egrave;s facilement des statistiques d&eacute;taill&eacute;es sur
            l'utilisation du site par les visteurs, une solution tr&egrave;s simple et
            tr&egrave;s efficace consiste &agrave; cr&eacute;er un compte Google Analytics puis &agrave;
            r&eacute;cup&eacute;rer le  n&deg; identifiant de ce compte (il ressemble &agrave;
            UA-1234566-2) et enfin &agrave; renseigner cet identifiant dans le param&egrave;tre
            GOOGLE_ANA_CODE de Expoactes. C'est tout, apr&egrave;s 24h &agrave; 48h les
            premi&egrave;res statistiques sont disponibles via votre compte Google
            Analytics.<br />
            Remarques importantes : </span>
          <ul>
            <li><span> il est indispensable de renseigner dans le compte
                l'adresse du r&eacute;peertoire principale du logiciel qui comporte les
                code Google Analytics. En l'occurence, ici c'est le r&eacute;pertoire
                actes : l'adresse du site doit donc &ecirc;tre par exmpple
                "http://XXXX.monsite.fr/actes" </span><span>.</span></li>
            <li><span>si vous souhaitez faire suivre les statistique d'un site
                plus important dans le r&eacute;pertoire actes n'est qu'une partie, il
                faut alors ajouter vous-m&ecirc;me le code javascript fourni pas
                Google dans toutes les autres pages du site. <br />
                <br />
                Pour plus de d&eacute;tails voir <a href="http://www.google.com/analytics/fr-FR/index.html">http://www.google.com/analytics/fr-FR/index.html</a></span>
              . </li>
          </ul>
        </li>
      </ul>
      <h5 align="left"><a id="SHOW_ACCES" name="SHOW_ACCES"></a>Divers</h5>
      <ul>
        <li><strong>Affichage des conditions d'acc&egrave;s priv&eacute;</strong> [SHOW_ACCES]
          : <br />
          D&eacute;termine l'item "Conditions d'acc&egrave;s" appara&icirc;t dans le menu public.
          Cet item n'a pas lieu d'&ecirc;tre si l'acc&egrave;s est totalement libre
          (USER_LEVEL = 4)</li>
        <li><strong>Affichage de l'ic&ocirc;ne RSS</strong> [SHOW_RSS] :<br />
          D&eacute;termine si le lien avec ic&ocirc;ne du flux RSS est affich&eacute; dans le cadre
          des statistiques. </li>
        <li><strong>Temps maximum pour l'ex&eacute;cution d'une page</strong>
          [MAX_EXEC_TIME] : <br />
          Ce temps permet d'obliger ExpoActes &agrave; limiter le temps d'ex&eacute;cution des
          op&eacute;rations de chargement, de backup, ... plus strictement que ce qui
          est d&eacute;tect&eacute; en se basant sur les param&egrave;tres PHP. Ne mettre une valeur
          inf&eacute;rieure &agrave; 30 que si l'on rencontre des probl&egrave;mes r&eacute;p&eacute;t&eacute;s de blocage
          de l'affichage de pages incompl&egrave;tes.</li>
        <li><strong>Nombre maximal d'actes s&eacute;lectionn&eacute;s par requ&ecirc;te</strong>
          [MAX_SELECT_REC] : <br />
          Certains serveurs MySQL interdisent des requ&ecirc;tes qui rapportent un
          trop grand nombre de r&eacute;ponses ce qui peut poser probl&egrave;me pour les
          backups. Dans ce cas, le logiciel affiche le message "Aucun acte
          export&eacute;" alors que l'on voit bien qu'il y a un grand nombre d'actes
          qui auraient pu &ecirc;tre export&eacute;s. Il faut donc modifier la valeur du
          pr&eacute;sent param&egrave;tre. <br />
          Ce pram&egrave;tre permet donc de limiter les requ&ecirc;tes lors des exports et
          backups lorsque c'est n&eacute;cessaire pour ne pas d&eacute;passer la limite
          imposs&eacute;e par le serveur.<br />
          Un valeur de 25000 ou m&ecirc;me 50000 est alors souvent judicieuse mais
          rend impossible les exports plus grands que ce nombre de lignes par
          fichier produit (en effet, un export produit un seul fichier tandis
          qu'un backup peut produire plusieurs fichiers). <br />
          La valeur 0, renseign&eacute;e par d&eacute;faut, ne limite pas les requ&ecirc;tes.</li>
      </ul>
    </blockquote>
    <h4><a id="Utilisateurs" name="Utilisateurs"></a>Gestion des utilisateurs
      (onglet Utilisateurs) </h4>
    <blockquote>
      <h5><a id="Public_level" name="Public_level"></a>Niveau d'acc&egrave;s public aux
        donn&eacute;es des actes </h5>
      <p>De nombreux utilisateurs du logiciel souhaitent contr&ocirc;ler la diffusion
        du d&eacute;tail des actes en la retreignant &agrave; des personnes pr&eacute;alablement
        enregistr&eacute;es ou aux membres d'une association. Pour cela, il convient de
        d&eacute;finir d'abord jusqu'&agrave; quel niveau de d&eacute;tail les informations sont
        diffus&eacute;es &agrave; tout le monde. C'est le r&ocirc;le du param&egrave;tre PUBLIC_LEVEL. </p>
      <ul>
        <li><strong>Niveau d'acc&egrave;s public (sans login)</strong> [PUBLIC_LEVEL] :<br />
          Ce param&egrave;tres d&eacute;termine le niveau d'acc&egrave;s qui est autoris&eacute; en mode
          "public" c'est-&agrave;-dire sans devoir fournir un login et un mot de passe.<br />
          <br />
          Les valeurs admises sont :
          <ul>
            <li>1 = Acc&egrave;s public &agrave; la liste des communes uniquement; </li>
            <li>2 = Acc&egrave;s public aux patronymes et p&eacute;riodes concern&eacute;es
              (&eacute;quivalent des listes "&eacute;clair"; &nbsp; </li>
            <li>3 = Acc&egrave;s public aux "tables" avec noms, pr&eacute;noms et dates (ou
              ann&eacute;es) des actes; </li>
            <li>4 = Acc&egrave;s public aux d&eacute;tails des actes. </li>
          </ul>
          <p>Par d&eacute;faut, la valeur est 4 pour laisser la libre consultation des
            tables et des actes.</p>
        </li>
      </ul>
      <h5><a id="USER_AUTO_DEF" name="USER_AUTO_DEF"></a>Mode de cr&eacute;ation des
        comptes des utilisateurs enregistr&eacute;s</h5>
      <p>Le logiciel permet de cr&eacute;er les comptes utilisateur de trois mani&egrave;res
        diff&eacute;rentes : </p>
      <ul>
        <li>Soit de fa&ccedil;on totalement manuelle et ponctuelle : l'administrateur
          (niveau 9) compl&egrave;te le formulaire de cr&eacute;ation du nouvel utilisateur;</li>
        <li>Soit par import d'un fichier CSV dûment structur&eacute; comprenant la
          liste des utlisateurs &agrave; cr&eacute;er. (<a href="gestuser.html">voir &agrave; ce
            sujet l'aide sp&eacute;cifique</a>);</li>
        <li>Soit en laissant les candidats utilisateurs compl&eacute;ter eux-m&ecirc;me un
          formulaire d'incription. Dans ce derniers cas, il convient de pr&eacute;ciser
          si l'utilistateur nouveau est automatiquement et imm&eacute;diatement accept&eacute;
          ou si sa demande doit d'abord &ecirc;tre valid&eacute;e par l'administrateur. </li>
      </ul>
      <p>Les deux premiers modes sont consid&eacute;r&eacute;s comme "manuels" car ils
        n&eacute;cessitent l'intervention de l'administrateur. Le param&egrave;tre
        USER_AUTO_DEF permet de d&eacute;finir la strat&eacute;gie d'enregistrement des
        utilisateurs. Le second param&egrave;tre fixe le niveau d'acc&egrave;s attribu&eacute;
        automatiquement.</p>
      <ul>
        <li><strong>Enregistrement des utilisateurs</strong> [USER_AUTO_DEF] : <br />
          Mode d'enregistrement des utilisateurs et distribution des logins :
          <ul>
            <li>0 : Enregistrement toujours manuel par l'administrateur;</li>
            <li>1 : Enregistrement semi-automatique via formulaire avec
              approbation obligatoire par l'administrateur;</li>
            <li>2 : Enregistrement tout automatique sur base des valeurs par
              d&eacute;faut de gestion des points.</li>
          </ul>
        </li>
        <li><strong>Niveau d'acc&egrave;s apr&egrave;s enregistement auto.</strong>
          [USER_AUTO_LEVEL] : <br />
          Niveau d'acc&egrave;s attribu&eacute; automatiquement aux personnes qui
          s'enregistrent directement sur le site. Par d&eacute;faut, USER_AUTO_LEVEL
          vaut 4.</li>
      </ul>
      <p><strong>Attention</strong> : </p>
      <ul>
        <li>Les modes 1 et 2 n&eacute;cessitent que le fonctionnement du serveur mail
          soit parfait car tous les &eacute;changes sont r&eacute;alis&eacute;s par mail;</li>
      </ul>
      <p>Pour pr&eacute;munir le serveur de l'enregistrement automatique de faux
        utilisateurs par des robots, un m&eacute;canisme de "captcha" c'est-&agrave;-dire
        d'image dissimulant un code qui ne peut &ecirc;tre d&eacute;chiffr&eacute; que par une
        personne humaine a aussi &eacute;t&eacute; pr&eacute;vu. Il est &eacute;videmment recommand&eacute; de le
        mettre en oeuvre mais il peut arriver que certains h&eacute;bergements ne
        fournissent pas la librairie graphique PHP (GD2) n&eacute;cessaire &agrave; son bon
        fonctionnement. Un param&egrave;tre a donc &eacute;t&eacute; ajout&eacute; pour d&eacute;sactiver les
        captchas si le serveur ne le permet pas.</p>
      <ul>
        <li><strong>Affichage d'un code captcha</strong> [AUTO_CAPTCHA] : <br />
          Indique si les captcha peuvent &ecirc;tre affich&eacute;s. Par d&eacute;faut, AUTO_CAPTCHA
          vaut 1.</li>
      </ul>
      <p>Logiquement on s'attend &agrave; ce que les utilisateurs enregistr&eacute;s disposent
        d'une adresse mail personnelle et donc que tous les utilisateurs aient
        des adresses mail distinctes. Ce n'est pas toujours le cas chez les
        couples de g&eacute;n&eacute;alogistes .. qui partagent parfois la m&ecirc;me adresse. Il
        est d&egrave;s lors possible de d&eacute;sactiver la d&eacute;tection contre les doublons des
        adresses mail.</p>
      <ul>
        <li><strong>V&eacute;rifier l'unicit&eacute; des adresses mail</strong>
          [TEST_EMAIL_UNIC] : <br />
          Interdit l'enregistrement de deux utilisateurs avec la m&ecirc;me adresse
          email. </li>
      </ul>
      <blockquote></blockquote>
      <h5><a id="LIMITE_EXPIRATION" name="LIMITE_EXPIRATION"></a>Dur&eacute;e de
        validit&eacute; d'un compte - Date d'expiration </h5>
      <p>La version 3 introduit une notion de dur&eacute;e de validit&eacute; d'un compte afin
        de pouvoir g&eacute;rer automatiquement le fait de bloquer le compte apr&egrave;s une
        certaine dur&eacute;e ou &agrave; un date pr&eacute;d&eacute;ternim&eacute;e. Sans indication dans cette
        zone, les comptes cr&eacute;&eacute;s n'expirent jamais (ou en fait &agrave; une date
        tellement lointaine, le 31-12-2033, que c'est &eacute;quivalent).</p>
      <ul>
        <li> <strong>Date limite ou dur&eacute;e des comptes</strong>
          [LIMITE_EXPIRATION] : Cette zone permet de pr&eacute;ciser la valeur par
          d&eacute;faut qui sera utilis&eacute;e pour la cr&eacute;ation de nouveau comptes
          utilisateurs. Elle admet deux formes de valeurs :
          <ul>
            <li> Soit une date fixe au format JJ/MM/AAAA : cette date est
              utilis&eacute;e syst&eacute;matiquement;</li>
            <li>soit un nombre unique qui pr&eacute;cise une dur&eacute;e en JOURS &agrave; compter
              de la date de cr&eacute;ation : la date r&eacute;elle sera donc calcul&eacute;e en
              ajoutant ce nombre de jour &agrave; la date courante. </li>
          </ul>
        </li>
      </ul>
      <p>Remarques :</p>
      <ul>
        <li>La date ainsi calcul&eacute;e pour toujours &ecirc;tre modifi&eacute;e par
          l'adminsitrateur lors de la cr&eacute;ation manuelle du compte. Par contre,
          lors de la cr&eacute;ation automatis&eacute;e, cette date est employ&eacute;e tant qu'elle
          n'est pas modifi&eacute;e par l'administrateur.</li>
        <li>Les comptes existant, cr&eacute;&eacute; avecnt la version 3, h&eacute;ritent toujours
          d'une date d'expiration "illimit&eacute;e" car le syst&egrave;me ne peut pr&eacute;juger de
          la politique adopt&eacute;e pour chause visiteur. &nbsp; <br />
        </li>
      </ul>
      <h5><a id="DUREE_EXPIR" name="DUREE_EXPIR"></a>D&eacute;lai avant suppression des
        comptes expir&eacute;s</h5>
      <p>Il est possible de supprimer des comptes qui sont expir&eacute;s depuis un
        temps d&eacute;termin&eacute;. En effet, ces comptes sont inutilisable et si les
        propri&eacute;taires n'ont pas marqu&eacute; leur intention de les faire renouveler on
        peut consid&eacute;rer qu'ils sont d&eacute;finitivement inutilisables. Il peut &ecirc;tre
        utile de les &eacute;liminer pour g&eacute;rer plus facilement les comptes actifs. Le
        param&egrave;tre DUREE_EXPIR donne le nombre de jours de d&eacute;passement de la date
        d'expiration apr&egrave;s lequel un compte<strong> peut &ecirc;tre s&eacute;lectionn&eacute;</strong>
        pour suppression. Notez que cette supression n'est jamais automatique
        mais doit &ecirc;tre demand&eacute;e dans la gestion des utilisateurs. La valeur par
        d&eacute;faut est de 90 jours. </p>
      <h5><a id="USER_ZONE_LIBRE" name="USER_ZONE_LIBRE"></a>Zone
        personnalisable dans la liste des utilisateurs </h5>
      <p>La version 3 ajoute &eacute;galement une possibilit&eacute; de collecter une
        information suppl&eacute;mentaire aux donn&eacute;es standard concernant
        l'utilisateur. Cette zone peut alors &ecirc;tre &eacute;tiquet&eacute;e au choix de
        l'adminsitrateur et elle figurera dans le formulaire d'auto-inscription
        des utilisateurs. Elle pourra permettre, par exemple, de collecter
        l'adresse ou un  n&deg; d'affiliation du nouveau membre. </p>
      <ul>
        <li> <strong>Libell&eacute; de la zone libre</strong> [USER_ZONE_LIBRE] :
          Cette zone permet d'ecoder le libell&eacute; ou la question pos&eacute;e &agrave;
          l'utilisateur lors de son inscription. Si la zone reste vide, alors la
          zone libre n'est pas affich&eacute;e dans le formulaire d'auto-inscription <br />
        </li>
      </ul>
      <h5><a id="CHANGE_PW" name="CHANGE_PW"></a>Droits donn&eacute;s aux utilisateurs</h5>
      <ul>
        <li><strong>Niveau pour pouvoir changer de mot de passe</strong>
          [CHANGE_PW] : <br />
          D&eacute;termine le niveau d'acc&egrave;s &agrave; partir duquel un utilisateur enregistr&eacute;
          a le droit de modifier lui-m&ecirc;me son mot de passe. Par d&eacute;faut,
          CHANGE_PW vaut 1.<br />
          Si plusieurs utilistateurs doivent partager le m&ecirc;me code d'acc&egrave;s et le
          m&ecirc;me mot de passe (par exemple au niveau 4), il est prudent d'en
          interdire la modification. &nbsp; <br />
        </li>
      </ul>
      <h5><a id="GEST_POINTS" name="GEST_POINTS"></a>Gestion de points pour
        limiter le nombre d'actes pouvant &ecirc;tre affich&eacute;s par utilisateur</h5>
      <p><span style="font-weight: bold;">Certains utilisateurs du logiciel ont
          souhait&eacute; que soit inclus un moyen de limiter le nombre de consultation
          d'actes d&eacute;taill&eacute;s. </span><br style="font-weight: bold;" />
        <span style="font-weight: bold;">Cette gestion est tout &agrave; fait
          facultative et n'est pas mise en oeuvre par d&eacute;faut.</span><br />
        Pour l'activer il faut modifier les valeurs des trois param&egrave;tres
        ci-dessous qui d&eacute;termineront les modes d'attribution des "points" aux
        utilisateurs enregistr&eacute;s.<br />
        <br />
        Le syst&egrave;me fonctionne sur base d'un capital de "points" qui sont
        affect&eacute;s aux utilisateurs &nbsp; disposant d'un code de login. Ces points
        peuvent &ecirc;tre attribu&eacute;s manuellement par l'administrateur ou
        automatiquement par le programme. Dans ce dernier cas, les param&egrave;tres
        permettent de fixer le nombre de points qui sont automatiquement
        attribu&eacute;s &agrave; chaque utilisateur ainsi que la p&eacute;riodicit&eacute; avec laquelle
        cette "recharge" a lieu. Le syst&egrave;me est extr&ecirc;mement souple car il
        permet aussi bien de pr&eacute;voir que l'on peut "voir" maximum 10 actes par
        jour (recharger 10 points tous les 1 jours) jusqu'&agrave; 1000 actes sur un an
        (recharger 1000 points tous les 365 jours).<br />
        <br />
        La recharge n'est pas cumulative: ainsi si la recharge est fix&eacute;e par
        exemple &agrave; 30 points tous les 7 jours, un visiteur qui ne vient sur le
        site qu'une fois tous les trois mois dispose de 30 points qui lui sont
        affect&eacute; le jour où il revient sur le site (et non 480 points qui se
        seraient accumul&eacute;s). C'est en effet, au moment du login que le syst&egrave;me
        recharge le compte lorsque les conditions sont remplies.<br />
        <br />
        Le syst&egrave;me permet toutefois &agrave; l'administrateur de donner &agrave; qui il veut
        des points suppl&eacute;mentaires ou de faire une recharge interm&eacute;diaire.
        Enfin, l'administrateur peut donner &agrave; chaque membre le "r&eacute;gime" qui
        lui convient : soit la recharge automatique, soit la recharge manuelle
        soit encore le libre acc&egrave;s. Les membres avec les statuts 8 et 9
        (administrateurs) disposent d'ailleurs automatiquement d'un libre acc&egrave;s.<br />
        <br />
        Notons encore que le syst&egrave;me ne d&eacute;compte pas de point &agrave; un d&eacute;posant
        pour voir les actes qu'il a d&eacute;pos&eacute;. Par contre, il n'a pas &eacute;t&eacute; pr&eacute;vu
        d'ajouter des points aux d&eacute;posants car il aurait &eacute;t&eacute; trop facile de
        d&eacute;poser 1000 actes puis de les supprimer pour "recharger" son compte
        sans difficult&eacute;. A charge pour l'administrateur de g&eacute;rer ces situations
        &agrave; sa discr&eacute;tion.</p>
      <p>Notons que lorsqu'un utilisateur ne dispose plus d'aucun point, les
        dates dans les tables sont syst&eacute;matiquement limit&eacute;es &agrave; l'ann&eacute;e. L'acc&egrave;s
        &agrave; la date compl&egrave;te (et au d&eacute;tail de l'acte) n&eacute;cessite de recouvrer des
        points. <br />
        <br />
        Les param&egrave;tres &agrave; d&eacute;finir sont les suivants : </p>
      <ul>
        <li><strong>Mode de gestion des points</strong> [GEST_POINTS] : <br />
          D&eacute;termine le r&eacute;gime de gestion des points par d&eacute;faut:
          <ul>
            <li>0 : aucune gestion des points pour aucun membre;</li>
            <li>1 : gestion des points avec recharge manuelle. C'est
              l'adminsitrateur qui distribue les points et lui seul;</li>
            <li>2 : gestion des points avec recharge automatique. La recharge
              s'effectuera automatiquement pour tous les membres auxquel
              l'administrateur affectera le r&eacute;gime 2 (valeur par d&eacute;faut).</li>
          </ul>
        </li>
        <li><strong>Points donn&eacute;s &agrave; chaque recharge automatique</strong>
          [PTS_PAR_PER] : <br />
          D&eacute;termine le nombre de points qui sont attribu&eacute;s aux membres &agrave; chaque
          recharge automatique. </li>
        <li><strong>Nombre de jours entre deux recharges auto.</strong>
          [DUREE_PER_P] : <br />
          D&eacute;termine le nombre de jours qui s&eacute;parent deux recharges
          automatiques. &nbsp; </li>
        <li><strong>Recherche autoris&eacute;e si points &eacute;puis&eacute;s</strong>
          [RECH_ZERO_PTS] : <br />
          Autorise ou interdit la r&eacute;alisation de recherches lorsque le stock de
          points est &eacute;puis&eacute;. &nbsp; </li>
      </ul>
      <h5><a id="DEPOSANT_LEVEL" name="DEPOSANT_LEVEL"></a>Liste des d&eacute;posants</h5>
      <ul>
        <li><strong>Niveau min. de la liste des d&eacute;posants</strong>
          [DEPOSANT_LEVEL] : <br />
          Niveau &agrave; partir duquel un utilisteur apparait dans les liste des
          d&eacute;posants lors des import par l'administrateur. Cette liste permet &agrave;
          l'administrateur d'importer des donn&eacute;es en lieu et place des
          utilisateurs qui n'ont pas l'expertise n&eacute;cessaire pour effectuer cette
          op&eacute;ration. Pour ne pas encombrer cette liste, il est possible de la
          limiter aux niveau de 9 &agrave; 6, 5 ou 4. </li>
      </ul>
      <h5><a id="CONDIT_USAGE" name="CONDIT_USAGE"></a>Conditions d'utilisation
      </h5>
      <ul>
        <li><strong>Texte des conditions d'utilisation</strong>
          [TXT_CONDIT_USAGE] : <br />
          Ce texte ne peut appara&icirc;tre que lors de la cr&eacute;ation d'un nouveau
          compte par les utilisteurs eux-m&ecirc;me (si Enregistrement des
          utilisateurs est &agrave; 1 ou 2). Si la zone est compl&eacute;t&eacute;e, le texte est
          affich&eacute; dans le formulaire de lecture des coordonn&eacute;es du nouvel
          utilisteur ainsi qu'une case &agrave; cocher qui doit &ecirc;tre explicitement
          coch&eacute;e pour que la demande de cr&eacute;ation de compte soit prise en compte.
          Le texte &agrave; afficher peut &ecirc;tre aussi long que n&eacute;cessaire. </li>
      </ul>
    </blockquote>
    <h4> &nbsp; </h4>
    <p align="center"><a href="aide.html">Retour &agrave; la liste des fichiers d'aide</a></p>
    <h3 align="center">-o-O-o- <br />
    </h3>
  </body>
</html>
